{"path":"changelog","templateID":3,"sharedPropsHashes":{},"localProps":{"post":{"contents":"<h1 id=\"december-21\">December 21</h1>\n<ul>\n<li>Feature: Desktop app version 1.6.11: Any emails in your documents from the old Gmail plugin that are stuck “Loading…” will be fixed when you click to open the email</li>\n</ul>\n<h1 id=\"december-20\">December 20</h1>\n<ul>\n<li>Fix: The first character on a line in an Asian language was incorrect</li>\n<li>Fix: Typing in Asian languages was sometimes not updating caret position</li>\n<li>Fix: Typing in Asian languages was sometimes doubling text in Safari</li>\n</ul>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Autocorrect works much better</li>\n</ul>\n<h1 id=\"december-15\">December 15</h1>\n<p>Email sync is back! <a href=\"/blog/email-is-back\">See the blog post for details.</a>\n<br>\n<br></p>\n<ul>\n<li>Feature: Full sync with Gmail in the new Email Pane which can pull in multiple Gmail accounts, has a unified All Accounts inbox, supports forwarding and replying to messages, and composing new messages. It displays and composes emails using Gmail so it’s full-featured and familiar.</li>\n<li>Fix: The Mac app was sometimes crashing on Big Sur when authenticating Gmail if you declined Bluetooth permissions</li>\n<li>Fix: ! after a prefix in the add item popup was sometimes not showing the date picker</li>\n<li>Fix: Context menus and modal menus were sometimes blocking clicks on buttons outside of them</li>\n<li>Change: Updated the Mac app icon for Big Sur</li>\n</ul>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Autocorrect works better</li>\n</ul>\n<h1 id=\"december-4\">December 4</h1>\n<ul>\n<li>Fix: Shift + left arrow was not working for some people</li>\n<li>Fix: Dates could display twice if immediately following a tag with no space</li>\n</ul>\n<h1 id=\"december-1\">December 1</h1>\n<p>Big update! New mobile app along with some desktop improvements. <a href=\"/blog/new-mobile-app\">See the blog post for details.</a>\n<br></p>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Feature: Inbox Pane and Files Pane support</li>\n<li>Feature: Code blocks support</li>\n<li>Feature: New date picker with easier repeat date selection</li>\n<li>Feature: The mobile app now uses a board called “Mobile” which you can modify in the web/desktop version</li>\n<li>Change: The top bar works more like the web app, shrinking when you scroll down, and now has a back button.</li>\n<li>Change: All of the menus are now bottom sheets that go fullscreen if the keyboard is open. This makes it easier to quickly preview notes and dates without a full screen navigation.</li>\n<li>Change: Autocomplete is now an inline popup instead of a full screen navigation</li>\n<li>Speed: Generally feels faster, smoother, and more stable</li>\n<li>Speed: Improved load time, especially if you have large deleted documents</li>\n</ul>\n<h3 id=\"desktop\">Desktop</h3>\n<ul>\n<li>Feature: Links can now be used without the http:// so for example just <code>moo.do</code> will parse as a link</li>\n<li>Fix: Selection was sometimes not expanding into children correctly</li>\n<li>Fix: Overview not immediately showing deleted documents in the Trash after deleting</li>\n<li>Fix: Calendar was sometimes not correctly scrolling to Today</li>\n<li>Fix: Deleting an item synced to Google Calendar by hotkey or menu was sometimes not removing it from Google Calendar</li>\n<li>Fix: Toolbar boards were not scrollable</li>\n<li>Fix: Closing a note was not always restoring selection correctly</li>\n<li>Speed: Improved performance of animations: context menu and modal menu opening, panes, pane headers, and pane items</li>\n<li>Speed: Improved load time, especially if you have large deleted documents</li>\n</ul>\n<h1 id=\"november-3\">November 3</h1>\n<ul>\n<li>Fix: Typing in the Move To menu with multiple items selected was deleting the selected items</li>\n<li>Fix: Moving a hierarchy of items with the Move To menu was losing the hierarchy</li>\n</ul>\n<h1 id=\"october-9\">October 9</h1>\n<ul>\n<li>Fix: Backspace and delete sometimes dropping item dates</li>\n<li>Fix: Disabling the Drive plugin was sometimes not immediately updating the checkbox</li>\n<li>Fix: Occasional failure to scroll to the previously zoomed item when zooming out</li>\n</ul>\n<h1 id=\"september-27\">September 27</h1>\n<ul>\n<li>Fix: The Drive plugin was sometimes not loading files saved to panes</li>\n<li>Fix: Drive data coming in remotely was not immediately updating the rendered item</li>\n<li>Fix: Drive files stuck as “Loading…” are still clickable to open in Drive</li>\n<li>Fix: The Drive plugin was not syncing immediately after signing in for users who’ve cancelled Premium</li>\n<li>Fix: Numbered list exports use the actual number and tasks use [ ] or [x] if complete</li>\n<li>Fix: Item linking autocomplete now selects the first item by default</li>\n<li>Fix: Invoices were not scrollable</li>\n<li>Change: Exporting a plugin exports as with its link to its service</li>\n</ul>\n<h1 id=\"september-26\">September 26</h1>\n<ul>\n<li>Fix: <span class=\"hotkey\">date:none</span> filter was not working correctly</li>\n<li>Fix: Switching between Outline and List views was not updating pane history correctly</li>\n</ul>\n<h1 id=\"september-20\">September 20</h1>\n<ul>\n<li>Fix: Changing the filter in Calendar panes was scrolling into the past</li>\n</ul>\n<h1 id=\"september-17\">September 17</h1>\n<ul>\n<li>Fix: Pasting a file/image was inserting after the selected item</li>\n<li>Fix: Typo in confirm delete message</li>\n<li>Fix: Crash on load if a saved email had no messages</li>\n</ul>\n<h1 id=\"september-12\">September 12</h1>\n<ul>\n<li>Fix: Crash dropping emails on tag pane headers</li>\n<li>Feature: Global search now runs the same search code as pane filters so it supports all the same features, including quotes and dates</li>\n</ul>\n<h1 id=\"september-10\">September 10</h1>\n<ul>\n<li>Fix: Rewrote selection to track by item id instead of index, which makes selection generally more stable</li>\n<li>Feature: <span class=\"hotkey\">Cmd + Click</span> on Mac or <span class=\"hotkey\">Ctrl + Click</span> on Windows to select multiple (non-contiguous) items</li>\n<li>Speed: Much improved scrolling performance - it looks smoother while scrolling, especially in Safari or Firefox on slower computers.</li>\n</ul>\n<h1 id=\"september-3\">September 3</h1>\n<ul>\n<li>Fix: Collapse all was not working sometimes in Project view</li>\n<li>Fix: Completing an item matching text filter in a pane hiding complete items would briefly flash its hidden siblings briefly</li>\n</ul>\n<h1 id=\"september-1\">September 1</h1>\n<ul>\n<li>Feature: All plugins support multiple accounts now - added multiple account support for Contacts and Drive</li>\n<li>Fix: Plugin sync was sometimes delayed up to 30 seconds after load</li>\n</ul>\n<h1 id=\"august-30\">August 30</h1>\n<ul>\n<li>Fix: Code blocks no longer parse formatting, links, tags, or contacts</li>\n</ul>\n<h1 id=\"august-29\">August 29</h1>\n<ul>\n<li>Feature: Add Tab as a key to select out of autocomplete</li>\n<li>Fix: Copying was sometimes duplicating prefixes</li>\n</ul>\n<h1 id=\"august-28\">August 28</h1>\n<ul>\n<li>Fix: The collapse all button wasn’t working sometimes</li>\n</ul>\n<h1 id=\"august-20\">August 20</h1>\n<ul>\n<li>Fix: data:images were sometimes not parsing correctly</li>\n<li>Fix: Some new users signing up by email were getting stuck on Connecting…</li>\n</ul>\n<h1 id=\"august-14\">August 14</h1>\n<ul>\n<li>Fix: Emails in the Inbox were sometimes not loading if the Gmail plugin was still enabled but not syncing</li>\n<li>Fix: Inbox panes were crashing sometimes on malformed emails</li>\n</ul>\n<h1 id=\"august-6\">August 6</h1>\n<ul>\n<li>Speed: Moved a fix only for old browsers to load only if required, which shaves 548 KB (or 15%) off the app size</li>\n</ul>\n<h1 id=\"august-5\">August 5</h1>\n<ul>\n<li>Feature: <strong>Global Search</strong> - Press <span class=\"hotkey\">Cmd + Shift + F</span> on Mac or <span class=\"hotkey\">Ctrl + Shift + F</span> on Windows/Linux to open a global search popup. This can either scroll to the selected item or zoom to it. And it can open in the current pane, a new pane, or a popup pane. <a href=\"/blog/search\">See the blog post for details.</a></li>\n<li>Fix: Long pane heading were sometimes taking up two lines even if only displaying on one line</li>\n</ul>\n<h1 id=\"july-30\">July 30</h1>\n<ul>\n<li>Feature: <strong>Normal Search</strong> - Press <span class=\"hotkey\">Cmd + F</span> on Mac or <span class=\"hotkey\">Ctrl + F</span> on Windows/Linux to open a normal text search which scrolls to search results. This was previously the hotkey for Filter, which is changed to <span class=\"hotkey\">Ctrl + F</span> on Mac or <span class=\"hotkey\">Alt + F</span> on Windows/Linux.</li>\n<li>Fix: The Chrome extension and Gmail addon are updated to not require selecting a document to save to</li>\n<li>Fix: The Chrome extension login button did not immediately update the UI</li>\n<li>Fix: Inbox Pane now loads only the most recently updated emails (to save bandwidth usage)</li>\n<li>Fix: Completing emails in the Inbox Pane was not immediately hiding them</li>\n<li>Fix: Added <span class=\"hotkey\">Cmd + Enter</span> on Mac or <span class=\"hotkey\">Ctrl + Enter</span> completing hotkey in the Inbox Pane to match other panes</li>\n<li>Fix: Filtering was not scrolling to the top if text was highlighted</li>\n</ul>\n<h1 id=\"july-27\">July 27</h1>\n<ul>\n<li>Fix: Dropping an non-matching item on a filtered pane appeared to do nothing</li>\n<li>Fix: Text filters were breaking rendering of code blocks</li>\n</ul>\n<h1 id=\"july-26\">July 26</h1>\n<ul>\n<li>Fix: Some malformed emails were not loading correctly</li>\n<li>Fix: Empty items were not clickable in Safari</li>\n<li>Fix: Signing into an account with an encryption password was asking for the password twice</li>\n</ul>\n<h1 id=\"july-24\">July 24</h1>\n<ul>\n<li>Feature: Code blocks! <a href=\"/blog/codeblocks\">See the blog post for details.</a></li>\n<li>Fix: Crash on load in some rare cases of malformed emails</li>\n<li>Fix: Cutting inline text was making subsequent UI updates appear to have no effect</li>\n</ul>\n<h1 id=\"july-23\">July 23</h1>\n<ul>\n<li>Fix: Cmd + Backspace after escaped markdown was deleting one at a time instead of the whole line</li>\n<li>Fix: Dropping at the bottom of a pane was not working since the recent big update</li>\n<li>Fix: Stop adding prefixes to text while copying unless the whole item is selected</li>\n<li>Fix: Added a button for the Gmail Addon to plugin settings</li>\n<li>Speed: More performance improvements to scrolling</li>\n</ul>\n<h1 id=\"july-21\">July 21</h1>\n<ul>\n<li>Fix: Deleting one item from non-Outline views was showing a message about deleting multiple items</li>\n<li>Fix: Calculating today’s date was wrong if today was the start of the week</li>\n<li>Fix: Moved context menus above toasts</li>\n<li>Speed: Improved smoothness of scrolling on slower devices</li>\n</ul>\n<h1 id=\"july-20\">July 20</h1>\n<ul>\n<li>Fix: iOS and Android apps updated with all the latest fixes</li>\n</ul>\n<h1 id=\"july-19\">July 19</h1>\n<ul>\n<li>Fix: <strong>Repeated reauthenticate messages:</strong> We’re now doing Google plugin authentication in a new way, storing refresh tokens in the database (encrypted) instead of depending on Google’s client-side authentication, which has degraded into reporting many users as signed out and causing reauthentication messages. Moo.do will continue to use the old method as long as it works for you, but if you reauthenticate it will use the new method and should fix this for good. If you prefer to use the old method for some reason, you can disable “Use new authentication” in the General settings.</li>\n<li>Fix: Email messages that were migrated from the Gmail plugin were sometimes not loading</li>\n</ul>\n<h1 id=\"july-12\">July 12</h1>\n<ul>\n<li>Fix: Panes were sometimes scrolling down on the first keypress</li>\n<li>Fix: The Demo button in Help was not working</li>\n<li>Fix: Deleting a document and then encrypting another document was causing a broken state on other devices because there were no accessible documents</li>\n</ul>\n<h1 id=\"july-11\">July 11</h1>\n<ul>\n<li>Feature: Added strikethrough formatting. It’s in the formatting toolbar and uses the hotkey <span class=\"hotkey\">Cmd + Shift + X</span> on Mac or <span class=\"hotkey\">Ctrl + Shift + X</span> on Windows/Linux. And in Markdown, wrap the text in <span class=\"hotkey\">~~</span>.</li>\n</ul>\n<h1 id=\"july-10\">July 10</h1>\n<ul>\n<li>Fix: Some issues from the last update with Chinese input</li>\n</ul>\n<h1 id=\"july-8\">July 8</h1>\n<p>This is the biggest single update we’ve ever had! <a href=\"/blog/inboxpane\">See the blog post for details.</a>\n<br/>\n<br/></p>\n<ul>\n<li>Change: Redesigned pane headers, with big bold breadcrumbs</li>\n<li>Change: Indent alignment is changed to align to text instead of prefixes. If you prefer the old way, there’s any option in the Display Settings.</li>\n<li>Change: Pressing <span class=\"hotkey\">Tab</span> or <span class=\"hotkey\">Shift + Tab</span> indents the item and its subtree. If you want to indent just the single item, use <span class=\"hotkey\"><span class=\"hotkeyPri\"></span> + [</span> and <span class=\"hotkey\"><span class=\"hotkeyPri\"></span> + ]</span>.</li>\n<li>Feature: A new Inbox Pane, which shows emails saved by the <a href=\"https://chrome.google.com/webstore/detail/moodo/dfphnckjoinkfflhfbnjoiggfflnekcb\">Chrome Extension</a> and <a href=\"https://gsuite.google.com/marketplace/app/moodo/597847337936\">Gmail Add-On</a></li>\n<li>Feature: Multiple Font options in the Display Settings, defaulting to San Francisco on Mac, Segoe UI on Windows, and Noto Sans on Linux</li>\n<li>Feature: Added support for Base64 images. Just paste in a data:image and you’ll see a pretty picture.</li>\n<li>Feature: Added OPML support. It’s now an option in the import and export windows, and is also supported in paste.</li>\n<li>Feature: Added support for <span class=\"hotkey\">file:///</span> urls for linking to local files</li>\n<li>Feature: Added <span class=\"hotkey\">===</span> as a heavy divider line, in addition to <span class=\"hotkey\">—</span> which is a light divider line</li>\n<li>Feature: Search for <span class=\"hotkey\">date: any</span> to match items with any date</li>\n<li>Feature: Search for<span class=\"hotkey\">date: none</span> for items with no date</li>\n<li>Feature: Use quotes in date searches to for more complex dates like <span class=\"hotkey\">after:”June 20”</span></li>\n<li>Feature: A new <span class=\"hotkey\">between</span> search for for showing dates in a range, like <span class=\"hotkey\">between:today,today+3</span></li>\n<li>Feature: Added a message to the top of the Drive pane to select items from Drive</li>\n<li>Feature: Added edit and remove link options to the context menu on links</li>\n<li>Fix: Tons of fixes to text formatting, including bugs in searching for text that had formats in it, formatting around prefixes, pressing enter in the middle of formatted text, etc… It should be rock solid now.</li>\n<li>Fix: If you have “Show Markdown” disabled, * and _ characters no longer mess with formatting</li>\n<li>Fix: Paste has been rewritten from scratch and works much better</li>\n<li>Fix: Undo/redo is generally more stable and restores selection better</li>\n<li>Fix: Search for dates was buggy in some cases with recurring dates</li>\n<li>Fix: Clicking links no longer requires holding a modifier key</li>\n<li>Fix: Images work better, specifically editing around them and resizing them</li>\n<li>Fix: Moving items between documents now moves them directly (instead of deleting the old items and creating new items) which is faster and fixes it breaking internal links</li>\n<li>Fix: Sorting boards is generally better, more nicely animated, and is faster</li>\n<li>Fix: The document renaming popup starts with the current name</li>\n<li>Fix: Item animations are much smoother</li>\n<li>Fix: Inputting accented characters was sometimes not working</li>\n<li>Fix: All the places that show today’s date change automatically after midnight more consistently</li>\n<li>Fix: Linked items were showing up as false positives in searches</li>\n<li>Speed: Pane and item rendering is rewritten from scratch so working in panes generally feels smoother, resizing panes and scrolling feels smoother, and load time is improved</li>\n<li>Speed: Resizing calendar events is much faster (it was previously modifying the item while resizing, and now it waits until it’s finished resizing)</li>\n</ul>\n<h1 id=\"july-2\">July 2</h1>\n<ul>\n<li>Feature: Emails saved into documents with the Gmail plugin (not your whole inbox, just any emails saved to documents) are migrated over to <a href=\"/blog/chromeextension/\">our email integration</a>, so that saved emails will continue to work after Google disables the Gmail plugin on July 8. See <a href=\"/blog/chromeextension/\">the blog post</a> for more details of how we are adapting email in Moo.do because of Google’s new policies. And we have big improvements to the new email integration coming soon.</li>\n</ul>\n<h1 id=\"june-6\">June 6</h1>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Pasting certain text was crashing sometimes</li>\n<li>Fix: Occasional crash in calendar menu</li>\n</ul>\n<h1 id=\"may-25\">May 25</h1>\n<ul>\n<li>Fix: Improved handling of panes whose active documents were deleted in another board</li>\n</ul>\n<h1 id=\"may-22\">May 22</h1>\n<ul>\n<li>Feature: Support pasting OPML</li>\n<li>Feature: New OPML export option in Export Data menu</li>\n<li>Fix: Complex nested formatting was sometimes not rendering properly</li>\n<li>Fix: Parsing HTML with nested formatting</li>\n<li>Fix: Paste was stripping spans of multiple spaces</li>\n<li>Fix: OPML import was breaking formatting characters and slow</li>\n</ul>\n<h1 id=\"may-21\">May 21</h1>\n<ul>\n<li>Fix: Formatting and notes were sometimes not pasting correctly from Workflowy</li>\n<li>Fix: Paste was stripping out whitespace</li>\n</ul>\n<h1 id=\"may-19\">May 19</h1>\n<ul>\n<li>Fix: Paste from Outlook was sometimes not formatting corrrectly</li>\n<li>Fix: Pasted images ending in a query string (like ?width=120) were not recognized as images</li>\n</ul>\n<h1 id=\"may-12\">May 12</h1>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Feature: Dark mode! Moo.do will now use the system dark mode setting, and Moo.do has a new setting to choose light or dark mode</li>\n<li>Change: The keyboard toolbar is now two rows and the buttons show the state for the selected item</li>\n<li>Change: Bottom tabs always show text instead of only when selected, and they’re now white with a light shadow</li>\n<li>Fix: Editing text generally works much more smoothly</li>\n<li>Fix: Search waits to update until the keyboard is closed so it won’t hide items while typing</li>\n<li>Fix: Some items were measuring incorrectly and overflowing onto another line unnecessarily</li>\n<li>Fix: On Android, tapping an item sometimes moved the keyboard toolbar into the wrong place</li>\n<li>Fix: On iOS, the keyboard coming up was hiding the status bar</li>\n<li>Fix: Scrolling the tapped item into place is faster and smoother</li>\n<li>Fix: The overview drawer was sometimes flashing gray while the app opened</li>\n<li>Fix: Setting a time before setting a date sometimes caused a crash</li>\n<li>Fix: Added items were not using the default prefix</li>\n<li>Fix: The app could get stuck on Updating… after clearing app data</li>\n<li>Fix: Tapping a note in multiselect now selects its parent item</li>\n<li>Fix: Increased vertical spacing in the Agenda so it doesn’t crop times</li>\n<li>Speed: Improved load time when Gmail plugin is enabled</li>\n</ul>\n<h1 id=\"may-10\">May 10</h1>\n<ul>\n<li>Feature: New Gmail Add-On for saving emails to Moo.do from Gmail in any browser and even the Gmail iOS and Android apps. <a href=\"/blog/gmailaddon\">See blog post for details.</a></li>\n</ul>\n<h1 id=\"may-9\">May 9</h1>\n<ul>\n<li>Fix: A brand new copy/paste system which supports more complex hierarchies and embedded images, and fixes many bugs in the old pasting system. Please let us know if you see any issues with copy/paste after this update.</li>\n</ul>\n<h1 id=\"may-5\">May 5</h1>\n<ul>\n<li>Feature: Panes have a back button at the top left. This responds to changes in zoomed item, search, and filter changes.</li>\n<li>Feature: Clicking a linked item will navigate the current pane to it. <span class=\"hotkey\"><span class=\"hotkeyPri\"></span> + Click</span> will open in a popup, and <span class=\"hotkey\"><span class=\"hotkeyPri\"></span> + Shift + Click</span> will open it in a new pane. See the options on hovering the linked item.</li>\n<li>Feature: Search matches against linked items</li>\n<li>Feature: If a linked item is blank, the link says “(Linked item has no text)”</li>\n<li>Feature: If deleting an item that is linked to, it will confirm before deleting</li>\n<li>Feature: A link to a deleted item says “(Deleted item)”</li>\n<li>Fix: Don’t allow dropping on empty items, only above or below</li>\n</ul>\n<h1 id=\"may-2\">May 2</h1>\n<ul>\n<li>Fix: Adding a local document was adding an empty synced document, with colliding duplicate ids</li>\n<li>Fix: Trash in overview is collapsed by default</li>\n<li>Fix: Pasting from Slack now handles Slack’s strangely formatted line breaks properly</li>\n<li>Fix: Setting star or priority no longer removes complete</li>\n</ul>\n<h1 id=\"may-1\">May 1</h1>\n<ul>\n<li>Fix: Reduced the occurrence of messages about failed authentication</li>\n<li>Fix: OneNote icon was missing on OneNote app links</li>\n<li>Fix: Syncing changes to text and date at the same time was sometimes causing dates to go missing or text to revert</li>\n<li>Fix: Clicking a date in the date popup was sometimes moving the event forward 30 minutes or resetting the duration</li>\n<li>Fix: Boards were sometimes sorting differently when hovered</li>\n<li>Fix: Panes were sometimes not animating into place in the desktop app</li>\n<li>Fix: Maximizing an email compose window wasn’t going fullscreen</li>\n<li>Change: All of the animations (pane position, opening overview, opening menus) should be nicer and smoother</li>\n<li>Change: Maximizing an email compose window animates to fullscreen</li>\n</ul>\n<h1 id=\"april-23\">April 23</h1>\n<ul>\n<li>Fix: Syncing changes to an item’s text and date at the same time was sometimes causing dates to go missing or text to revert</li>\n</ul>\n<h1 id=\"april-19\">April 19</h1>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Feature: Pressing enter scrolls the new item above the keyboard</li>\n<li>Fix: Editing text around plugin items works much better</li>\n<li>Fix: Plugin items were not measuring correctly, so items with plugins could overflow onto an invisible second line</li>\n<li>Fix: Pressing enter at the end of an item with a plugin was not working</li>\n<li>Fix: Pressing backspace to delete an empty item was not selecting the end of the previous item if it had a prefix</li>\n<li>Fix: Account settings legacy options were not starting with the saved setting</li>\n</ul>\n<h1 id=\"april-14\">April 14</h1>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Speed: Massive improvment to load time of Email pane</li>\n<li>Fix: Closing an email preview was sometimes crashing the Android app</li>\n</ul>\n<h1 id=\"april-12\">April 12</h1>\n<ul>\n<li>Feature: New Overview design, combining the Documents and Overview into one large hierarchy. <a href=\"/blog/overview\">See blog post for details.</a></li>\n</ul>\n<h1 id=\"april-4\">April 4</h1>\n<ul>\n<li>Feature: New Chrome extension for adding emails to Moo.do from Gmail and for saving the current page as a link in Moo.do. <a href=\"/blog/chromeextension\">See blog post for details.</a></li>\n</ul>\n<h1 id=\"april-3\">April 3</h1>\n<ul>\n<li>Fix: Text editing was sometimes janky on Android</li>\n</ul>\n<h1 id=\"march-31\">March 31</h1>\n<ul>\n<li>Feature: Added a “Use Legacy Drive” option to plugin settings. For those of you who had enabled the Drive plugin a while ago and it stopped showing the full contents of your Drive, enabling this should show the full contents again.</li>\n<li>Fix: Moo.do was always popping out to the login screen for some users with an email-only account and no name set, then showing a bunch of crashes after logging in.</li>\n<li>Fix: The menu to upload a file or image was not uploading correctly</li>\n<li>Fix: Detect having local documents with the same ID as synced documents</li>\n<li>Fix: Clicking context menus close to the bottom of the screen was auto clicking the item below the mouse</li>\n</ul>\n<h1 id=\"march-18\">March 18</h1>\n<ul>\n<li>Fix: Google suddenly started sending differently formatted responses sometimes, which was breaking sync with Google services</li>\n</ul>\n<h1 id=\"march-15\">March 15</h1>\n<ul>\n<li>Fix: Some calendar views being empty</li>\n<li>Fix: Scroll offset of today was sometimes wrong, and was the root cause of other problems</li>\n<li>Fix: Day width calculations were sometimes slightly wrong so the last day of the week would overflow</li>\n<li>Fix: The last week of each month in month view didn’t have a bottom border</li>\n<li>Fix: Changing the start of the week now updates the items in the month view</li>\n<li>Fix: Dates were sometimes not updating properly when the date changed</li>\n</ul>\n<h1 id=\"march-12\">March 12</h1>\n<ul>\n<li>Fix: Item text was (very rarely) being saved with a ? character in iOS app</li>\n</ul>\n<h1 id=\"march-6\">March 6</h1>\n<ul>\n<li>Fix: A sync issue where in some edge cases synced changes would not display correctly until reload</li>\n<li>Fix: Items were still being initialized in deleted documents</li>\n<li>Fix: Internal links in imported documents were being broken by ID regenerating</li>\n</ul>\n<h1 id=\"march-1\">March 1</h1>\n<ul>\n<li>Feature: Sync collapsed state across devices</li>\n</ul>\n<h1 id=\"february-22\">February 22</h1>\n<ul>\n<li>Fix: Sign in button on login screen was sometimes opening the wrong popup</li>\n<li>Fix: Reauthorization errors could have been caused by a bad internet connection, or resuming from suspend. So it tries to ensure you’re online before authorizing, and shows a retry button which will likely fix it. Successful authorizations now clear the messages.</li>\n</ul>\n<h1 id=\"february-20\">February 20</h1>\n<ul>\n<li>Fix: Drive pane was not loading correctly for email/password accounts</li>\n</ul>\n<h1 id=\"february-18\">February 18</h1>\n<ul>\n<li>Fix: Gmail labels with duplicate names were sometimes not syncing correctly</li>\n<li>Fix: Gmail syncs immediately after updating sync accounts</li>\n<li>Fix: First load on a new device was sometimes showing incorrect Gmail labels until refresh</li>\n</ul>\n<h1 id=\"february-15\">February 15</h1>\n<ul>\n<li>Fix: Searched email panes were getting stuck in Loading on refresh</li>\n</ul>\n<h1 id=\"february-14\">February 14</h1>\n<ul>\n<li>Fix: Some users were seeing repeated reauthorization messages</li>\n</ul>\n<h1 id=\"february-13\">February 13</h1>\n<ul>\n<li>Fix: When sharing a document the list of collaborators was sometimes not updating immediately</li>\n<li>Fix: Email panes were sometimes not loading their labels list if using email signin and the overview was open on load</li>\n</ul>\n<h1 id=\"february-12\">February 12</h1>\n<ul>\n<li>Fix: Collapse and expand were not working correctly in all views</li>\n<li>Fix: Dragging an item with a tag onto a tag block with a similar name was not working</li>\n</ul>\n<h1 id=\"february-11\">February 11</h1>\n<ul>\n<li>Fix: Email compose windows were not expanding for their content</li>\n</ul>\n<h1 id=\"february-10\">February 10</h1>\n<ul>\n<li>Feature: Dragging an item with an email onto an Email pane will apply the label of that pane</li>\n<li>Fix: Dragging emails onto labels in overview</li>\n<li>Fix: Icons in email overview were not spaced correctly</li>\n</ul>\n<h1 id=\"february-9\">February 9</h1>\n<ul>\n<li>Fix: Item date sync was not properly syncing their Google Calendar info. This could have resulted in items not knowing they’re synced to calendar, and creating duplicates on the calendar. If you’re seeing mismatched calendar events, signing out and back in should fix it. And then it shouldn’t happen again.</li>\n<li>Fix: Syncing calendar colors tries to ensure unique colors. It was sometimes getting the same color if a calendar was in multiple accounts.</li>\n<li>Fix: With multiple sync accounts it was sometimes considering the wrong one as the primary account</li>\n<li>Fix: “undefined” was somehow getting into the sync accounts list</li>\n</ul>\n<h1 id=\"february-7\">February 7</h1>\n<ul>\n<li>Feature: <strong>Email/password signin:</strong> In the “Moo.do Account” section of Settings, you can manage which signin methods are linked to your account. The login page now has two buttons, for Google and email signin. <a href=\"/blog/emailpassword\">See blog post for details.</a></li>\n<li>Feature: A new setting (enabled by default) to sync new events to the default Google Calendar by default</li>\n<li>Fix: Some calendar sync errors were not being handled correctly</li>\n</ul>\n<h1 id=\"january-31\">January 31</h1>\n<ul>\n<li>Feature: Backspace key and an X button to clear hotkey settings</li>\n<li>Fix: Desktop app hotkey settings were broken by the hotkeys update</li>\n<li>Fix: Escape key was not working in note editor</li>\n<li>Fix: Escape key cancels out of hotkey input</li>\n</ul>\n<h1 id=\"january-27\">January 27</h1>\n<ul>\n<li>Feature: <strong>Template sharing:</strong> Right click on a Board Folder and select “Save as Public Template”. This will let you name the template and then give you a URL you can share. This creates a copy of all of the documents in those boards, which does not stay in sync. You can update the template by saving it again.</li>\n<li>Feature: <strong>Multiselect drag/drop:</strong> when you highlight multiple items you can drag and drop all of them.</li>\n<li>Feature: <strong>Custom Hotkeys:</strong> See the Settings for a new Hotkeys page where you can set your own hotkeys. This is a Premium feature.</li>\n<li>Feature: Added a new demo page: <a href=\"https://www.moo.do/demo/\">https://www.moo.do/demo/</a></li>\n<li>Speed: Reduced app size by 1.07 MB (23%)</li>\n<li>Fix: Deleting the end of a line before a prefixed item was including its prefix</li>\n</ul>\n<h1 id=\"january-18\">January 18</h1>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Feature: Can now add documents</li>\n<li>Feature: Added a no priority button to the priority button in the keyboard toolbar</li>\n<li>Change: Tap the left side of a header or bullet to zoom and the right side to collapse</li>\n<li>Change: Keyboard toolbar buttons are smaller with some secondary menus so it doesn’t have to scroll</li>\n<li>Change: Breadcrumbs in the header for easy zooming out</li>\n<li>Change: Updated design with white header and a border instead of shadow</li>\n<li>Change: Moved toasts above the bottom bar</li>\n<li>Change: Aligned collapser to the top of the text instead of centered</li>\n<li>Fix: Items were sometimes not updating horizontal position after zoomin</li>\n<li>Fix: Tapping a date in the Agenda now opens the date picker</li>\n<li>Fix: Bottom bar was placed incorrectly on iPhone X</li>\n<li>Fix: Prefixes were not vertically aligned correctly on Android</li>\n<li>Fix: Status bar height was incorrect on iPhone X and was not hiding on rotation</li>\n<li>Fix: Indent/outdent buttons were not re-rendering item immediately</li>\n<li>Fix: Long press was much too sensitive</li>\n<li>Fix: Agenda add button was not scrolling into view</li>\n<li>Fix: Scrolls to top when zooming in/out</li>\n<li>Fix: Inline elements tap handlers were overriding multiselection</li>\n<li>Fix: Note did not inherit parent’s priority or star</li>\n<li>Fix: Flat view was not immediately re-rendering flat</li>\n</ul>\n<h1 id=\"january-17\">January 17</h1>\n<ul>\n<li>Fix: Tag and contact autocomplete in search were not inserting # or + characters</li>\n<li>Fix: Tag autocomplete was not showing exact matches</li>\n</ul>\n<h1 id=\"january-14\">January 14</h1>\n<ul>\n<li>Fix: Sidebar button text was turning into … at certain widths</li>\n<li>Change: Boards with name length &lt;= 2 characters don’t reduce font size</li>\n</ul>\n<h1 id=\"january-12\">January 12</h1>\n<ul>\n<li>Feature: Board folders (Premium) - Right click on a board to add it to a folder. Click the folder to collapse it.</li>\n<li>Feature: Clicking a sort mode a second time reverses the sort</li>\n<li>Fix: Small sidebar was not persisting</li>\n<li>Fix: Renaming boards was erroneously complaining about unique names</li>\n<li>Fix: Deleting a note from the context menu was showing a ghost note popup</li>\n</ul>\n<h1 id=\"january-11\">January 11</h1>\n<ul>\n<li>Fix: Mac app toolbar was offset as if in fullscreen after exiting fullscreen</li>\n<li>Fix: Clicking in document name field while renaming was opening the document</li>\n<li>Feature: Added a collapse button on the Trash, collapsed by default</li>\n</ul>\n<h3 id=\"desktop-apps-1-4-2\">Desktop apps 1.4.2</h3>\n<ul>\n<li>Fix: Fullscreen detection is now done natively so it won’t be broken by auto-hiding menu bar</li>\n<li>Fix: Auto-updater is working again</li>\n<li>Fix: Zoom in hotkey was not working</li>\n</ul>\n<h1 id=\"january-6\">January 6</h1>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Gmail pane was not immediately being added or removed after toggling Gmail plugin</li>\n<li>Fix: Email and calendar sync were sometimes failing if sync data was invalid</li>\n<li>Fix: Dragging to the end of a list was sometimes crashing</li>\n<li>Fix: Dragging out of the clipboard was sometimes crashing</li>\n</ul>\n<h1 id=\"january-3\">January 3</h1>\n<ul>\n<li>Fix: Revision history was crashing after the recent menu updates</li>\n<li>Fix: Plaintext and HTML export were sometimes hanging for some users</li>\n<li>Fix: Initial selection in intro popup was wrong</li>\n<li>Fix: Tooltips were showing on tags in agenda settings</li>\n</ul>\n<h1 id=\"january-2\">January 2</h1>\n<ul>\n<li>Fix: Gmail labels were sometimes failing to sync for secondary accounts</li>\n<li>Fix: Added a FIX button to plugin sync account settings as a fallback in case of sync errors</li>\n<li>Fix: Some minor styling of autocompletes was broken</li>\n</ul>\n<h1 id=\"january-1\">January 1</h1>\n<ul>\n<li>Fix: The live demos are working again in the old blog posts: <a href=\"/blog/kanban/\">Moo.do for Kanban</a> and <a href=\"/blog/project-management\">Moo.do for Project Management</a></li>\n</ul>\n<h1 id=\"december-31\">December 31</h1>\n<ul>\n<li>Fix: Date popup and some calendar views were crashing if you had set the “Start week on” setting since the recent settings UI update</li>\n<li>Fix: Exiting date popup was not restoring selection properly</li>\n</ul>\n<h1 id=\"december-30\">December 30</h1>\n<ul>\n<li>Fix: Email and calendar sync were sometimes failing if sync data was invalid</li>\n</ul>\n<h1 id=\"december-27\">December 27</h1>\n<ul>\n<li>Fix: New item popup opened by hotkey wasn’t showing document selector</li>\n<li>Fix: Creating a new document while offline and then adding items to it, and then going online, and then setting a document name was causing item text not to sync</li>\n<li>Change: Redesigned settings UI to be easier to read and more attractive</li>\n</ul>\n<h1 id=\"december-23\">December 23</h1>\n<h3 id=\"desktop-apps-1-4-1\">Desktop apps 1.4.1</h3>\n<ul>\n<li>Feature: A setting to use the system light/dark theme</li>\n<li>Feature: Global hotkeys for Create Item and Compose Email. See the Desktop App section of the settings to set the hotkeys.</li>\n<li>Fix: Google authentication was showing an error when authorizing plugins for some people.</li>\n</ul>\n<h1 id=\"december-22\">December 22</h1>\n<ul>\n<li>Change: Removed the new user Welcome screens and moved the Welcome steps into the Intro</li>\n</ul>\n<h1 id=\"december-21\">December 21</h1>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Rotation was sometimes causing item text to be cut off</li>\n<li>Fix: Contacts and links were sometimes not opening their popups</li>\n<li>Fix: Empty items had too much height</li>\n</ul>\n<h1 id=\"december-20\">December 20</h1>\n<ul>\n<li>Feature: Added date created, modified, and completed info to the bottom of the item context menu</li>\n<li>Feature: Added a compose email button to the top of an email pane, which uses that pane’s account as the From account</li>\n<li>Feature: Added an Agenda Month view</li>\n<li>Fix: Welcome screen was sometimes getting stuck in Connecting… after setting an encryption password</li>\n<li>Fix: Setting an encryption password was immediately prompting to enter the password</li>\n<li>Fix: Gmail search with no results was showing two status messages</li>\n</ul>\n<h1 id=\"december-16\">December 16</h1>\n<ul>\n<li>Fix: Signing in to a new instance of Moo.do on an account with a user password was sometimes getting stuck at “Loading documents”</li>\n</ul>\n<h1 id=\"december-15\">December 15</h1>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Feature: Sync accounts can now be added and modified in the mobile apps</li>\n<li>Fix: More stable sync with the new authentication system</li>\n<li>Fix: Some text padding and display issues in the Agenda</li>\n<li>Fix: Note preview showed some html and was not splitting lines</li>\n<li>Fix: Prevent drag/dropping between an item and its note</li>\n<li>Fix: Overview indentation sometimes messed up in Agenda</li>\n<li>Fix: Collapsed email conversations now show a preview of the email content</li>\n<li>Fix: Email previews handle rotation better</li>\n</ul>\n<h1 id=\"december-12\">December 12</h1>\n<ul>\n<li>Feature: Added support for pressing Enter in List view</li>\n<li>Fix: Dates and calendar events are generally more stable.</li>\n<li>Fix: Some items were invisible on calendar month view</li>\n<li>Fix: Selecting “Add to calendar” before entering a date was not adding the date to Google Calendar</li>\n<li>Fix: Pressing the down arrow above an item with a plugin could set selection into the middle of the plugin, and then pressing enter would duplicate it</li>\n</ul>\n<h1 id=\"december-11\">December 11</h1>\n<ul>\n<li>Fix: Plugin authentication uses a totally different method, which is more stable and less buggy</li>\n<li>Fix: Plugin sync handles going online/offline better and is overall more reliable</li>\n<li>Fix: Calendar plugin was clearing default save calendar if sync failed while offline</li>\n</ul>\n<h1 id=\"december-7\">December 7</h1>\n<ul>\n<li>Change: New help popup in the bottom right which opens by default for new users, and is organized in a better order than the old help</li>\n<li>Change: Changed default pane type to Outline</li>\n<li>Change: Increased tooltip hover delay</li>\n<li>Change: Addded spring effects to pane and overview positions, and to clicking the overview of a document</li>\n<li>Feature: Grayed “Type / to see options” hint in empty items</li>\n</ul>\n<h1 id=\"december-2\">December 2</h1>\n<h3 id=\"see-blog-post-for-details-mobile-speed\"><a href=\"/blog/mobile-speed\">See blog post for details: Mobile Speed</a></h3>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Speed: Switched to a new custom local database which loads much faster</li>\n<li>Speed: Improved speed of code bottlenecks in date parsing and date comparisons</li>\n<li>Speed: Editing and item changes were previously affecting all panes but now only the active pane</li>\n<li>Speed: Cache measured item heights and date calculations so it doesn’t need to be computed on every load</li>\n</ul>\n<h1 id=\"december-1\">December 1</h1>\n<ul>\n<li>Change: Enable Plugins and Sync Accounts settings merged into a new Sync Plugins page, which feels much more intuitive</li>\n<li>Fix: Add pane menu was always showing Email and Files even if plugins were disabled</li>\n</ul>\n<h1 id=\"november-27\">November 27</h1>\n<ul>\n<li>Fix: Calendars shared with multiple Google accounts could sometimes conflict because they were duplicated in Moo.do</li>\n<li>Fix: Items not matching the search filter were showing up in the overview if they were outside the visible tree of a deeply zoomed pane</li>\n</ul>\n<h1 id=\"november-26\">November 26</h1>\n<ul>\n<li>Fix: Plugins sometimes stopped syncing after coming back from suspend</li>\n<li>Fix: Emails and calendar events were sometimes not saving to the local cache properly</li>\n<li>Fix: Added an option to calendar pane menu to force calendar sync to fix the local cache</li>\n</ul>\n<h1 id=\"november-15\">November 15</h1>\n<ul>\n<li>Fix: Date popup was not closing properly from add item popup</li>\n<li>Fix: Inserting links into text was sometimes inserting an invalid address</li>\n<li>Fix: Styling of priority and starred items in add item popup</li>\n<li>Fix: Was not parsing “every last friday” correctly</li>\n<li>Fix: Search help text is clearer</li>\n<li>Fix: Escape key in a date popup opened by an add item popup was closing both popups</li>\n<li>Fix: Creating a task from an email did not have a document selector</li>\n<li>Fix: Cut and copy in the date popup were affecting the pane below it</li>\n</ul>\n<h1 id=\"november-1\">November 1</h1>\n<ul>\n<li>Fix: Invoices button in settings wasn’t showing if premium was cancelled</li>\n</ul>\n<h1 id=\"october-31\">October 31</h1>\n<ul>\n<li>Fix: Add item popup was not editable if a default prefix was set</li>\n<li>Fix: Note changes were being reset when toggling window size</li>\n</ul>\n<h1 id=\"october-29\">October 29</h1>\n<ul>\n<li>Fix: Evernote links weren’t working for some people</li>\n<li>Fix: Revoking sharing permissions wasn’t always updating immediately</li>\n</ul>\n<h1 id=\"october-28\">October 28</h1>\n<ul>\n<li>Fix: Popup pane was missing a close button</li>\n<li>Fix: Popup pane title was clickable</li>\n<li>Fix: Popup pane was showing a drag handle</li>\n<li>Fix: Dates weren’t parsing plural durations like “hours”, “hrs”, or “mins” correctly</li>\n</ul>\n<h1 id=\"october-27\">October 27</h1>\n<ul>\n<li>Change: Redesigned search hints to be more obviously closable</li>\n</ul>\n<h1 id=\"october-26\">October 26</h1>\n<ul>\n<li>Feature: The slash menu (or + button next to an empty item) has a new option to Choose From Drive</li>\n<li>Change: This does not affect current users: Google has changed their security policy so we can no longer request access to users’ full Drive. We can only see files Moo.do uploaded or that users choose with the above new feature. But if you’ve already approved full Drive access, nothing will change for you.</li>\n</ul>\n<h1 id=\"october-24\">October 24</h1>\n<ul>\n<li>Speed: Pane load time improved</li>\n<li>Fix: An error selecting when closing notes was showing an error message but not causing any real problems</li>\n</ul>\n<h1 id=\"october-22\">October 22</h1>\n<h3 id=\"see-blog-post-for-details-linking-to-items\"><a href=\"/blog/item-links\">See blog post for details: Linking to Items</a></h3>\n<h1 id=\"october-20\">October 20</h1>\n<ul>\n<li>Fix: Scheduling emails uses the new date selector</li>\n<li>Fix: Google Calendar sync was sometimes failing and showing error messages after the app had been open for a long time</li>\n</ul>\n<h1 id=\"october-19\">October 19</h1>\n<ul>\n<li>Fix: Filters were sometimes hiding subtrees temporarily when moving items</li>\n<li>Fix: Copying a whole item was only including part of the note</li>\n<li>Fix: Search for bullets with “-“ was not working</li>\n<li>Fix: Repeatedly adding and cancelling new calendar items was causing dates to shift</li>\n<li>Fix: Deleting a Google Calendar event was leaving it blue until the next reload</li>\n</ul>\n<h1 id=\"october-18\">October 18</h1>\n<ul>\n<li>Fix: Resizing calendar events starting at midnight was not working</li>\n<li>Fix: Autocompleting contacts in email compose was not clearing text</li>\n<li>Fix: Note popup was sometimes not selecting the item after closing it</li>\n<li>Fix: It was difficult to set selection after a plugin or date</li>\n</ul>\n<h1 id=\"october-17\">October 17</h1>\n<ul>\n<li>Fix: Formatting multiple items wasn’t working</li>\n<li>Fix: HTML characters in text were causing editing problems</li>\n<li>Fix: Prefixes were not working if an item was already formatted</li>\n</ul>\n<h1 id=\"october-16\">October 16</h1>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Pressing enter in a prefixed item was splitting off the last two characters</li>\n<li>Fix: Encryption password was not working for some people</li>\n<li>Fix: Toggling flat view was not working</li>\n<li>Fix: Swiping and dragging items was sometimes affecting the wrong item</li>\n<li>Speed: Load time improved by delaying loading of overview and non-visible panes</li>\n</ul>\n<h1 id=\"october-12\">October 12</h1>\n<ul>\n<li>Fix: Typing in Asian languages was not working in some cases after the October 10 update</li>\n</ul>\n<h1 id=\"october-11\">October 11</h1>\n<ul>\n<li>Fix: Improved handling of remote changes from calendar events</li>\n<li>Fix: Text saving to Google Calendar was including prefix</li>\n</ul>\n<h1 id=\"october-10\">October 10</h1>\n<h3 id=\"see-blog-post-for-details-editing-improvements\"><a href=\"/blog/editing\">See blog post for details: Editing improvements</a></h3>\n<br>\n\n<ul>\n<li>Feature: Export to HTML and plain text</li>\n<li>Feature: Formatting text with bold, italic, and underline generally work much better</li>\n<li>Fix: When pressing <span class=\"hotkey\"><span class=\"hotkeyPri\"></span> + K</span> to open the link editor while the cursor is inside a link, it will edit the link</li>\n<li>Fix: Pressing enter in the middle of formatted text now splits the text correctly</li>\n<li>Fix: Copying from Moo.do to paste into other apps is generally formatted better</li>\n<li>Fix: Adding text after a link was sometimes not working</li>\n<li>Fix: Export including archived items works better</li>\n<li>Speed: Load time and general editing performance improved</li>\n</ul>\n<h1 id=\"october-9\">October 9</h1>\n<ul>\n<li>Fix: Calendar day view was scrolling when moving events</li>\n<li>Fix: Dropping onto 12am in calendar views was not working</li>\n</ul>\n<h1 id=\"october-8\">October 8</h1>\n<ul>\n<li>Feature: <b>Slash help:</b> Type / in the beginning of an item to see a list of all the things you can add to the item.</li>\n</ul>\n<h1 id=\"october-7\">October 7</h1>\n<ul>\n<li>Fix: Calendar error messages were showing unnecessarily for simple network problems</li>\n<li>Fix: Improved stability of sync when adding items while offline and subsequently going online</li>\n<li>Fix: Email attachment downloading in the Mac/Windows apps were not updating the progress percentage correctly</li>\n<li>Fix: Deleting items from the context menu was not showing the warning about deleting many items</li>\n<li>Fix: Undo was not working properly in Local Files in the Mac/Windows apps when adding new items</li>\n<li>Change: Plugins, app links, and item links style changed to a light background instead of a border</li>\n<li>Feature: If any items are not syncing properly, press <span class=\"hotkey\"><span class=\"hotkeySec\"></span></span> and right click it, and you will see a “Fix sync” option at the bottom, which will force it to sync and you should see it appear on other instances of Moo.do.</li>\n</ul>\n<h1 id=\"october-1\">October 1</h1>\n<ul>\n<li>Fix: Boards and panes handle remote updates much better, so using multiple instances of Moo.do at once is much more stable.</li>\n<li>Fix: The popup menu when pasting an Evernote link was not showing the title</li>\n</ul>\n<h1 id=\"september-28\">September 28</h1>\n<ul>\n<li>Fix: Having multiple instances of Moo.do open at once was syncing pane state back and forth and recreating existing panes. This could among other things cause collapse state to get reset.</li>\n<li>Fix: Calendar sync was showing error messages too often</li>\n</ul>\n<h1 id=\"september-22\">September 22</h1>\n<ul>\n<li>Fix: Item details popup in the Calendar views was not saving the item’s note</li>\n<li>Fix: Notification of trial ending soon was showing too often</li>\n<li>Fix: Creating a new Google Calendar event without adding to a local document was not showing it immediately</li>\n<li>Fix: Dragging items to the side was not scrolling panes correctly</li>\n<li>Fix: List items in notes were not being split by the in-pane preview</li>\n</ul>\n<h1 id=\"september-14\">September 14</h1>\n<ul>\n<li>Fix: Completing the last instance of a repeat date with an end date will now fully complete it</li>\n</ul>\n<h1 id=\"september-11\">September 11</h1>\n<ul>\n<li>Fix: Events modified in Google Calendar were not updating until refresh</li>\n<li>Fix: Calendar and agenda panes were missing the Refresh button in their menus</li>\n</ul>\n<h1 id=\"september-9\">September 9</h1>\n<ul>\n<li>Fix: Calendar settings were not showing correctly for some users. If you were having trouble displaying Google Calendars, check the Google Calendar section of the settings again.</li>\n<li>Fix: Copying text in one item was including its note</li>\n<li>Fix: Copying a whole item with a note was only copying the end of the item</li>\n</ul>\n<h1 id=\"september-7\">September 7</h1>\n<ul>\n<li>Fix: Context menu hotkeys were cut off</li>\n<li>Fix: Completed sort was not working with None grouping</li>\n<li>Fix: Copy was making a starred item’s first child or its note starred</li>\n<li>Fix: Link parsing of certain malformed links was freezing the browser or app</li>\n</ul>\n<h1 id=\"september-2\">September 2</h1>\n<ul>\n<li>Fix: Deleting documents is now much smoother. Deleted documents will be moved to the Trash and sync much better between devices. You can right click on a deleted document to undelete it.</li>\n<li>Fix: If a document was created while offline and then Moo.do was restarted before coming back online, it was disappearing from the document list and not syncing. But the data was still there, so any affected documents will now reappear and sync properly.</li>\n</ul>\n<h2 id=\"august-31\">August 31</h2>\n<h3 id=\"release-of-pane-design-update\"><a href=\"/blog/desktop-panes\">Release of pane design update</a></h3>\n<h1 id=\"august-30\">August 30</h1>\n<ul>\n<li>Fix: Some rare sync issues when working offline. If you see any inconsistencies in your documents, you can edit the correct one and that fix the sync state.</li>\n</ul>\n<h1 id=\"august-28\">August 28</h1>\n<ul>\n<li>Feature: Archive email and Delete email options added to context menu when right clicking on an item outside of an Email pane</li>\n<li>Fix: Date searches such as <code>date:today</code> were not updating immediately on date change</li>\n</ul>\n<h1 id=\"august-27\">August 27</h1>\n<ul>\n<li>Feature: Search for <code>#</code> or <code>^</code> to match projects</li>\n</ul>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Keyboard toolbar height was incorrect on a small number of Android phones</li>\n</ul>\n<h1 id=\"august-24\">August 24</h1>\n<ul>\n<li>Feature: Search for <code>date:today+&lt;num&gt;</code> to show items <code>&lt;num&gt;</code> days from today</li>\n<li>Feature: Search for <code>*</code> and <code>!</code> to match star and priority, which you can combine with booleans for powerful filtering, like <code>* or !!</code> to match starred or at least medium priority items</li>\n<li>Feature: Added an “All day” option to times in date popup to clear an item’s time</li>\n<li>Fix: Date input was losing focus when clicking on a date or a time</li>\n<li>Speed: Improved performance of date searches</li>\n</ul>\n<h1 id=\"august-23\">August 23</h1>\n<ul>\n<li>Fix: Emails saved to Google Calendar were sometimes showing as Unknown Plugin in the calendar month view</li>\n<li>Fix: Paste into an empty item was leaving an extra empty item there</li>\n</ul>\n<h1 id=\"august-22\">August 22</h1>\n<ul>\n<li>Fix: Notes were sometimes not getting included in copy</li>\n<li>Fix: Undoing delete of an item with a note was not restoring the note, and notes were not appearing with their parent item in Deleted Items view</li>\n<li>Fix: Date was sometimes not getting cleared from local cache after a date was removed remotely, so it was appearing on the right side of an item</li>\n</ul>\n<h1 id=\"august-21\">August 21</h1>\n<ul>\n<li>Fix: Copy handles notes and hierarchy better</li>\n</ul>\n<h1 id=\"august-20\">August 20</h1>\n<ul>\n<li>Feature: Maximize button in the note editor to open it fullscreen</li>\n<li>Change: Improved design of popup menus, especially in Dark theme</li>\n<li>Fix: Agenda was not respecting the calendar filter</li>\n<li>Fix: Created and completed sort modes were not sorting items correctly</li>\n</ul>\n<h1 id=\"august-17\">August 17</h1>\n<ul>\n<li>Feature: Support pasting emojis</li>\n<li>Feature: Support Option / Alt + Click on contact to remove</li>\n<li>Feature: Support quoted searches, like <code>word1 &quot;quoted phrase&quot; -&quot;hide phrase&quot;</code></li>\n<li>Fix: Improved editing around emojis</li>\n<li>Fix: Sorting by date was not respecting repeat dates</li>\n<li>Fix: Timed items in the calendar month view were not sorting by time</li>\n<li>Fix: Dragging an item onto a different pane will drop with the collapsed state of the source pane</li>\n</ul>\n<h1 id=\"august-9\">August 9</h1>\n<ul>\n<li>Fix: Fixed issues with Moo.do being blocked on some corporate networks and with browsers blocking third party cookies</li>\n</ul>\n<h1 id=\"august-8\">August 8</h1>\n<ul>\n<li>Fix: Confirmation for deleting a large number of items now includes collapsed children in the count</li>\n<li>Fix: Text imported from OPML / Workflowy was not converting &amp; to &amp;</li>\n<li>Fix: Window Zoom hotkeys in apps were not working</li>\n<li>Fix: Date selection popup was entering range mode on click instead of drag</li>\n</ul>\n<h1 id=\"august-3\">August 3</h1>\n<ul>\n<li>Fix: Backspace at the beginning of an item with a note was deleting the note</li>\n<li>Fix: Contact sync was duplicating emails and phone numbers</li>\n<li>Fix: Click without modifier was opening urls</li>\n<li>Fix: When showing markdown on an image, the text was not splitting into multiple lines</li>\n<li>Fix: Linked images were sometimes duplicating</li>\n<li>Fix: Incorrect size of some calendar items</li>\n<li>Fix: Window resizing was scrolling calendar panes</li>\n</ul>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Tapping a phone number in the contact popup wasn’t opening dialer</li>\n<li>Fix: If Gmail plugin is disabled, tapping an email in the contact popup opens your email app</li>\n<li>Fix: Text was overflowing lines if device scale is higher than default</li>\n</ul>\n<h1 id=\"july-28\">July 28</h1>\n<ul>\n<li>Feature: A new Premium display setting to disabling blinking of the text cursor</li>\n<li>Fix: Revision History wasn’t showing notes</li>\n<li>Fix: Long notes in item details popup were overflowing</li>\n<li>Fix: Shift + Enter was not exiting the notes popup</li>\n<li>Fix: Item prefix was not displaying in the add item popup</li>\n<li>Fix: Copying and pasting a single item was not including its starredness or priority</li>\n<li>Fix: Completing “repeat on complete” dates was setting a time on the next instance</li>\n</ul>\n<h1 id=\"july-27\">July 27</h1>\n<ul>\n<li>Fix: Moo.do was not working in the Edge browser on Windows</li>\n<li>Fix: Contacts were sometimes failing to save if a contact name had a symbol in it</li>\n<li>Fix: Contacts loading from remote did not immediately turn green</li>\n<li>Fix: Repeating dates in the format “Every month on the 1st monday” were not saving properly</li>\n</ul>\n<h1 id=\"july-26\">July 26</h1>\n<ul>\n<li>Feature: Dragging items between documents</li>\n<li>Fix: Removing a note in local files was sometimes not having an immediate effect</li>\n</ul>\n<h1 id=\"july-24\">July 24</h1>\n<ul>\n<li>Fix: Adding/removing Gmail labels was not properly caching the change locally. This could for example make deleted emails pop back in after reload.</li>\n</ul>\n<h1 id=\"july-23\">July 23</h1>\n<ul>\n<li>Fix: Date popup respects “Start week on” setting</li>\n<li>Change: Updated <a href=\"/privacy/\">Privacy Policy</a> with details of how the new backend and encryption works</li>\n</ul>\n<h1 id=\"july-22\">July 22</h1>\n<ul>\n<li>Fix: Gmail pane was not doing a sync on load</li>\n<li>Fix: Workflowy import is now a simpler OPML importer so it will be more reliable</li>\n<li>Fix: Todoist import works better</li>\n<li>Change: Maximum sync days for Gmail is now 120 days for Premium users</li>\n</ul>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Panes were positioned wrong after rotating the screen</li>\n<li>Fix: Contact and tag popups were crashing sometimes</li>\n<li>Fix: In the Agenda pane, the collapser was showing next to an item’s parents instead of the item itself</li>\n<li>Change: Offline message moved above the tabs, and shows Connecting… in addition to Offline</li>\n<li>Change: Using a new error reporting system to make tracking down bugs easier</li>\n</ul>\n<h1 id=\"july-21\">July 21</h1>\n<ul>\n<li>Fix: Moo.do Account page of settings was sometimes not showing Premium section</li>\n<li>Fix: Handling of authorization errors works better</li>\n</ul>\n<h1 id=\"july-17\">July 17</h1>\n<h3 id=\"release-of-new-mobile-apps\"><a href=\"/blog/new-mobile\">Release of new mobile apps</a></h3>\n<h1 id=\"july-13\">July 13</h1>\n<ul>\n<li>Feature: Added a document selector to add item popup</li>\n<li>Fix: Star/priority wasn’t working in add item popup</li>\n<li>Fix: Deleting attachments from a composing email was sometimes not working</li>\n<li>Speed: Optimized Gmail syncing so it’s faster and downloads less data</li>\n</ul>\n<h1 id=\"june-16\">June 16</h1>\n<ul>\n<li>Fix: Deleted items were sometimes reappearing as blank spaces</li>\n<li>Fix: Calendar month blocks were crashing while rendering items with emails or drive files</li>\n<li>Speed: Optimized how often email sync saves to the local cache</li>\n</ul>\n<h1 id=\"june-13\">June 13</h1>\n<ul>\n<li>Fix: Undoing adding an item was not deleting it correctly</li>\n<li>Fix: Pane scroll was jumping around sometimes if the content height was less than the pane height</li>\n<li>Fix: Agenda wasn’t updating immediately when changing priority</li>\n<li>Fix: Dragging highlights all descendants of dragged item instead of just the immediate children</li>\n</ul>\n<h1 id=\"june-11\">June 11</h1>\n<ul>\n<li>Feature: Sharing a document with a non-Moo.do user will now send an email inviting them to join Moo.do and automatically share the document with them after they sign up.</li>\n</ul>\n<h1 id=\"june-10\">June 10</h1>\n<ul>\n<li>Fix: Note deletions were not updating the UI properly and were leaving empty spaces</li>\n</ul>\n<h1 id=\"june-9\">June 9</h1>\n<ul>\n<li>Fix: Changing document in a calendar pane was scrolling it into the past</li>\n<li>Fix: Dropping onto a calendar pane of a different document was just changing the time without moving to that document, so it appeared to do nothing. It now confirms whether to move to the other document and then moves it before setting the time.</li>\n<li>Fix: Calendar views were sometimes getting scrolled to the wrong place during/after an action</li>\n<li>Fix: Ensure calendar times are scrolled to the right place on load. They were sometimes incorrectly looking like midnight was at the top and didn’t update until the pane was scrolled.</li>\n</ul>\n<h1 id=\"june-7\">June 7</h1>\n<ul>\n<li>Fix: Renaming documents was sometimes not working</li>\n<li>Fix: Some items with emails could get into a state where they weren’t loading, and they’re now automatically fixed</li>\n<li>Fix: Emails sent with attachments were not loading for preview correctly immediately after sending</li>\n</ul>\n<h1 id=\"june-5\">June 5</h1>\n<ul>\n<li>Fix: Tags were not autocompleting if item had a bullet prefix or if text contained Markdown</li>\n</ul>\n<h1 id=\"june-1\">June 1</h1>\n<ul>\n<li>Fix: Changing the From of an email was sometimes causing the compose window to close</li>\n</ul>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Missing background color of swipe items in Gmail pane</li>\n</ul>\n<h1 id=\"may-30\">May 30</h1>\n<ul>\n<li>Fix: Archiving emails was broken during the recent change to archiving items</li>\n</ul>\n<h1 id=\"may-29\">May 29</h1>\n<ul>\n<li>Speed: Fix a regression from the previous update that slowed the “Move” menu</li>\n</ul>\n<h1 id=\"may-27\">May 27</h1>\n<ul>\n<li>Fix: Undoing complete wasn’t saving to database in some cases</li>\n</ul>\n<h1 id=\"may-24\">May 24</h1>\n<ul>\n<li>Fix: Items were getting marked as deleted in rare cases when rearranging deep hierarchy</li>\n<li>Fix: A few minor issues in sync where items did not immediately reflect the new state until the next refresh</li>\n<li>Feature: Deleted Items view for browsing and restoring deleted items. Find it in alongside the other view modes by clicking the pane title. If any of your items have ever gone missing, they should be in the Deleted Items view.</li>\n<li>Change: The Archived pane is now a view mode instead of its own pane type</li>\n<li>Change: The local cache now includes deleted items so that it more closely matches the remote database, to improve consistency and allow for the Deleted Items view.</li>\n<li>Speed: Archived and deleted items are now loaded lazily, only if their respective pane is open, which should improve load time if you had a lot of archived items.</li>\n</ul>\n<h1 id=\"may-23\">May 23</h1>\n<ul>\n<li>Fix: Pasting two links in a row without a space between them was failing to show the second link</li>\n<li>Fix: Panes were not resizable if panes were scrolled horizontally</li>\n<li>Fix: Insert link button in email compose was crashing</li>\n</ul>\n<h1 id=\"april-30\">April 30</h1>\n<ul>\n<li>Fix: Pane collapsed settings were not saving correctly in some cases</li>\n</ul>\n<h1 id=\"april-26\">April 26</h1>\n<ul>\n<li>Fix: Calendar sync was causing panes to reset scroll position</li>\n</ul>\n<h1 id=\"april-25\">April 25</h1>\n<ul>\n<li>Fix: Support multiple links in one item</li>\n<li>Fix: If copied text has markdown url with same text as url, just copy the plain url</li>\n<li>Fix: Copy was not copying all the text if the right side was inside markup</li>\n</ul>\n<h1 id=\"april-24\">April 24</h1>\n<ul>\n<li>Fix: Contacts were not syncing correctly in some cases</li>\n<li>Fix: Autocomplete for contacts was not working if followed by (hidden) markdown</li>\n<li>Fix: Enter at the beginning of formatted text was splitting formatting characters</li>\n</ul>\n<h1 id=\"april-23\">April 23</h1>\n<ul>\n<li>Fix: Deleted emails were reappearing after refresh</li>\n<li>Speed: Performance while typing with many panes open is much improved</li>\n</ul>\n<h1 id=\"april-6\">April 6</h1>\n<ul>\n<li>Fix: Adding calendars was not working</li>\n<li>Fix: date:overdue search was not working for non-repeat dates</li>\n</ul>\n<h1 id=\"april-1\">April 1</h1>\n<ul>\n<li>Fix: The math for calendar months was off, so sometimes a week was missing in the month view</li>\n<li>Fix: Some configurations of calendars could cause a crash when adding an item</li>\n</ul>\n<h1 id=\"march-24\">March 24</h1>\n<ul>\n<li>Fix: Paste could lose the first item in some cases if a list if a parent had a note</li>\n<li>Fix: Date searches on items with repeat dates could be wrong for date:overdue or sometimes with before and after searches</li>\n<li>Fix: Today button in month view was off by a couple weeks</li>\n</ul>\n<h1 id=\"march-21\">March 21</h1>\n<ul>\n<li>Fix: Clicking the right arrow in a calendar week view was not working in some cases</li>\n<li>Fix: If the last item in a copy was collapsed, it was not copying its children</li>\n<li>Fix: Copy was losing some hierarchy when copying very deep hierarchy</li>\n<li>Fix: Emails weren’t loading sometimes</li>\n</ul>\n<h1 id=\"march-10\">March 10</h1>\n<ul>\n<li>Fix: Items with emails or Drive files were not parsing tags or contacts correctly</li>\n</ul>\n<h1 id=\"march-8\">March 8</h1>\n<ul>\n<li>Fix: Undoing a delete could put the item back temporarily in the wrong order on synced devices</li>\n<li>Fix: Backups to Google Drive were happening too often in some cases</li>\n<li>Fix: Deleting an item’s date was sometimes not removing it on synced devices</li>\n<li>Fix: Deleting an item’s date was sometimes not removing it from Google Calendar</li>\n<li>Fix: Note editor in add item popup was not Tab accessible</li>\n<li>Fix: Opening calendars menu with no calendars was crashing</li>\n</ul>\n<h1 id=\"february-26\">February 26</h1>\n<ul>\n<li>Fix: Calendar pane was not showing Google Calendar items if created in a different document</li>\n<li>Fix: Calendars menu was showing calendar options even if calendar plugin disabled</li>\n<li>Fix: Display settings weren’t working after trial expired</li>\n</ul>\n<h1 id=\"february-18\">February 18</h1>\n<ul>\n<li>Fix: Flat Mode filter was causing the Tasks pane on mobile to render incorrectly in some cases</li>\n</ul>\n<h1 id=\"february-15\">February 15</h1>\n<ul>\n<li>Fix: Text in revision history includes dates</li>\n</ul>\n<h1 id=\"february-14\">February 14</h1>\n<ul>\n<li>Fix: Copying some text in an item with a date was copying the whole item</li>\n</ul>\n<h1 id=\"february-7\">February 7</h1>\n<ul>\n<li>Fix: Calendar times scrolling was broken by a recent update</li>\n</ul>\n<h1 id=\"february-5\">February 5</h1>\n<ul>\n<li>Fix: Sync accounts settings was not loading correctly in some cases</li>\n<li>Fix: “Add to” field when adding an item to a calendar was not using the pane’s document</li>\n<li>Fix: Importers are working again</li>\n</ul>\n<h1 id=\"february-4\">February 4</h1>\n<ul>\n<li>Fix: Paste was inserting items in the wrong order sometimes</li>\n<li>Fix: Undo of a multiline paste was leaving an extra item around</li>\n<li>Fix: If a backup used an old password, it was failing. Now it requests the password.</li>\n</ul>\n<h1 id=\"february-2\">February 2</h1>\n<ul>\n<li>Fix: Email draft contents could be lost if composition started while online, then internet connectivity was lost, and then Moo.do was restarted while offline</li>\n<li>Fix: Backspace was not working on Mac in the Email pane</li>\n<li>Change: Sending an email changes the send button to a spinner instead of the whole compose window</li>\n<li>Feature: Maximize button on email compose window to make it fullscreen</li>\n</ul>\n<h1 id=\"february-1\">February 1</h1>\n<ul>\n<li>Feature: Date popup has a dropdown to choose Google Calendar to add item to</li>\n<li>Feature: Item details popup in Calendar pane can remove from Google Calendar</li>\n<li>Fix: Dates synced to Google Calendar could sometimes not display on first load</li>\n<li>Fix: Undoing item deletion was sometimes putting the item back in the wrong order</li>\n</ul>\n<h1 id=\"january-30\">January 30</h1>\n<ul>\n<li>Fix: Search in email pane wasn’t working in some cases</li>\n<li>Fix: Panes were scrolling horizontally when they shouldn’t</li>\n<li>Fix: Settings changed offline were getting overwritten by remote value in some cases</li>\n</ul>\n<h3 id=\"version-1-3-0-of-desktop-apps-download\">Version 1.3.0 of desktop apps: <a href=\"/download/\">Download</a></h3>\n<ul>\n<li>Feature: Save Moo.do documents as files on your computer. See the <a href=\"/blog/local-files\">blog post</a> for more details.</li>\n<li>Feature: A setting for whether to back up locally in the new Desktop App section of Settings</li>\n<li>Fix: Window border looks better in Mac Dark mode</li>\n</ul>\n<h1 id=\"january-29\">January 29</h1>\n<ul>\n<li>Fix: Some repeat dates were not parsing correctly</li>\n</ul>\n<h1 id=\"january-28\">January 28</h1>\n<ul>\n<li>Fix: Images in Drive were not loading in some cases in the desktop apps</li>\n</ul>\n<h1 id=\"january-26\">January 26</h1>\n<ul>\n<li>Fix: Dropping files or images was incorrectly showing a message about missing Premium features in some cases</li>\n</ul>\n<h1 id=\"january-24\">January 24</h1>\n<ul>\n<li>Fix: Downloading attachments was not working in the desktop app</li>\n<li>Fix: Opening URLs was not working in desktop app</li>\n<li>Fix: In some cases, some email accounts or calendar accounts were not showing in their panes</li>\n<li>Fix: Repeat dates were not saving the day of the month correctly in some cases</li>\n<li>Fix: Support date formats like “every Feb 25”</li>\n<li>Fix: Accounts that had failed to add could sometimes be continuing to ask for reauthorization</li>\n<li>Feature: Show a red border on dates that are synced to Google Calendar</li>\n<li>Feature: Clicking on an email account in the top of a pane will switch to the Inbox or if it’s already open it will show all the accounts for easy switching</li>\n<li>Change: “Email Accounts” settings page renamed to “Sync Accounts” and now has checkboxes for each plugin</li>\n</ul>\n<h1 id=\"january-21\">January 21</h1>\n<ul>\n<li>Speed: Pastes of large numbers of items is much faster</li>\n<li>Fix: Closing the page/app quickly after pasting a large number of items could have left some items not saved</li>\n<li>Fix: Highlighting multiple items and then pasting multiple items was leaving a single empty item on remote devices</li>\n</ul>\n<h1 id=\"january-20\">January 20</h1>\n<ul>\n<li>Fix: Some items that had been pasted or imported were not loading properly</li>\n</ul>\n<h1 id=\"january-19\">January 19</h1>\n<ul>\n<li>Fix: Download page works correctly on Linux</li>\n<li>Fix: Dates repeating daily with “repeat on completed” option were setting next instance to today</li>\n</ul>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Dragging wasn’t working on iOS</li>\n<li>Fix: Settings and feedback pages weren’t scrollable</li>\n</ul>\n<h1 id=\"january-17\">January 17</h1>\n<ul>\n<li>Feature: Dates that recur from their completion date</li>\n</ul>\n<h1 id=\"january-16\">January 16</h1>\n<ul>\n<li>Feature: Icon on documents to show whether they’re pending upload or synced</li>\n<li>Fix: Undo was not syncing changes correctly in some cases</li>\n<li>Fix: Undo was not working at all for some actions like deleting items</li>\n</ul>\n<h1 id=\"january-15\">January 15</h1>\n<ul>\n<li>Fix: Notes handled by a remote device were not loading correctly</li>\n<li>Fix: Better handling of document properties changing remotely</li>\n<li>Fix: Changing collaborator access role was not working</li>\n<li>Fix: Clicking on time in the date popup didn’t always update the calendar pane immediately</li>\n</ul>\n<h1 id=\"january-14\">January 14</h1>\n<ul>\n<li>Fix: Messages were sometimes popping up on startup about items being hidden</li>\n<li>Fix: Errors when adding a new item and typing in it before naming it</li>\n</ul>\n<h1 id=\"january-12\">January 12</h1>\n<ul>\n<li>Fix: Composing emails was sometimes getting stuck on “Sending…”</li>\n</ul>\n<h1 id=\"january-11\">January 11</h1>\n<ul>\n<li>Change: Rewrote plugin caching to use the same caching and preloading system as the new documents and items. This brings some nice improvments:</li>\n<li>Fix: Emails and calendar events are visible on load instead of popping in after a second</li>\n<li>Fix: This should fix some problems with email syncing, especially with multiple accounts</li>\n</ul>\n<h1 id=\"january-10\">January 10</h1>\n<ul>\n<li>Fix: Notifications were not working properly with very short delay times</li>\n</ul>\n<h1 id=\"january-9\">January 9</h1>\n<ul>\n<li>Fix: Notifications work again with new dates system</li>\n<li>Fix: Clicking some Mailbird emails was not opening them. If this is happening to you, email <a href=\"mailto:support@moo.do\">support@moo.do</a> and we’ll help you fix it.</li>\n</ul>\n<h1 id=\"january-8\">January 8</h1>\n<ul>\n<li>Fix: Email panes were sometimes not showing all accounts on first load</li>\n<li>Fix: Google calendar items were sometimes not showing their calendar color</li>\n<li>Fix: Emails added in Mailbird on the old backend were stuck on Loading… If this is still happening to you, email <a href=\"mailto:support@moo.do\">support@moo.do</a> and we’ll help you fix it.</li>\n</ul>\n<h1 id=\"january-7\">January 7</h1>\n<ul>\n<li>Fix: Missing compose button in email pane on mobile</li>\n<li>Feature: Auto updater checks for updates every hour and shows a small update message with a link to the changelog</li>\n<li>Change: Added a check for updates button to the sync status popup and moved the version number there</li>\n</ul>\n<h1 id=\"january-6\">January 6</h1>\n<ul>\n<li>Fix: Some plugins were losing their cached data and showing as “Loading…”</li>\n<li>Fix: Resizing images wasn’t working quite right</li>\n<li>Feature: Show images as uploading until they’re done, and “Failed upload” for the ones that failed</li>\n</ul>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Missing compose button in email pane</li>\n</ul>\n<h1 id=\"january-2\">January 2</h1>\n<ul>\n<li>Feature: Document sorting by either last modified or alphabetical</li>\n<li>Feature: Repeat dates now show every single instance on the calendar</li>\n<li>Speed: Optimized agenda/calendar so that even with showing every instance of repeat dates it’s even faster than before</li>\n<li>Fix: Autocompletes (tags, contacts, move, etc…) use the pane document instead of the default document</li>\n<li>Fix: Clicking at the end of a #project with a tag/contact would not select correctly</li>\n<li>Fix: Tags can’t end with _ anymore so they don’t grab onto Markdown</li>\n<li>Fix: Dates were showing the wrong date in the inline text in some timezones</li>\n<li>Fix: Panes were reloading themselves after connecting to the server even if they didn’t change, or if a different board changed remotely</li>\n<li>Fix: Date autocomplete was closing itself if a calendar pane was open</li>\n<li>Fix: Import from old Moo.do wasn’t working in some cases</li>\n</ul>\n<h1 id=\"december-29\">December 29</h1>\n<ul>\n<li>Feature: Change or remove your user encryption password in the Security section of the settings</li>\n</ul>\n<h1 id=\"december-28\">December 28</h1>\n<ul>\n<li>Fix: Emails added to a document in Mailbird were not syncing correctly</li>\n</ul>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Selected pane and collapse state was not saving correctly on mobile</li>\n</ul>\n<h1 id=\"december-27\">December 27</h1>\n<ul>\n<li>Change: Changed the way item ordering is stored because it was causing crashes in some cases, like pastes of a lot of items</li>\n<li>Change: Show document name in pane header by always showing the breadcrumbs</li>\n<li>Fix: Don’t show date in breadcrumbs</li>\n<li>Fix: Paste was including dates of parents sometimes</li>\n<li>Fix: Item details popup was not showing calendar selector in some cases</li>\n<li>Fix: The View Invoices button works again in the new backend</li>\n<li>Fix: Some conflict resolution issues which could sometimes cause sync conflicts or items to not sync between collaborators correctly</li>\n<li>Fix: Conflict resolution works much better for boards and settings</li>\n<li>Fix: Some items added on calendar had duration of 6000 hours</li>\n<li>Fix: Events were duplicated on calendar sometimes</li>\n<li>Fix: Item details popup was not adding to the correct calendar</li>\n</ul>\n<h1 id=\"december-21\">December 21</h1>\n<ul>\n<li>Change: Backups has a document selector and sorts revisions with recent at top</li>\n<li>Fix: Stop complaining about missing authentication for accounts that were never successfully added</li>\n<li>Fix: Multiple contacts in one item was not working</li>\n<li>Fix: Selected pane and collapse state was not saving correctly on mobile</li>\n<li>Fix: The X button in Email Accounts settings was not working for some users</li>\n</ul>\n<h1 id=\"december-20\">December 20</h1>\n<ul>\n<li>Feature: New backup system which uses our own cloud storage and is enabled automatically to back up every 10 minutes (if something changed). Moo.do will still also backup to Drive if you enable the setting, and it’s also doing backups to your computer if you’re using the desktop app. The Revision History is now using the new system so it won’t show old backups, but those are still in Drive if you need them.</li>\n</ul>\n<h1 id=\"december-18\">December 18</h1>\n<ul>\n<li>Fix: Some sync and conflict resolution issues when an item is modified on multiple devices</li>\n</ul>\n<h1 id=\"december-17\">December 17</h1>\n<ul>\n<li>Fix: Revision history was not decrypting documents correctly</li>\n</ul>\n<h1 id=\"december-16\">December 16</h1>\n<ul>\n<li>Fix: Clicking links was not working in the desktop apps</li>\n<li>Fix: Renaming a board was not immediately updating remote clients</li>\n</ul>\n<h1 id=\"december-14\">December 14</h1>\n<ul>\n<li>Fix: Encrypted shared documents could fail to decrypt in some cases</li>\n<li>Fix: Undo/redo was not syncing correctly sometimes</li>\n</ul>\n<h1 id=\"december-13\">December 13</h1>\n<ul>\n<li>Fix: Decryption of shared document didn’t work if a user without encryption password shared a document without its own password to a user with encryption password. If this happened to you and you see garbled text, sign out and back in and it should decrypt correctly.</li>\n<li>Fix: Backup directory was getting computed incorrectly and backing up to the root</li>\n</ul>\n<h1 id=\"december-12\">December 12</h1>\n<ul>\n<li>Fix: Uploading files with Google drive is working again. It does not yet share with collaborators yet though. That’s coming soon.</li>\n<li>Fix: Go to in all panes works again</li>\n<li>Fix: Adding items from agenda and calendar puts the date inline correctly</li>\n<li>Fix: Add item popup works with new dates system</li>\n<li>Feature: Export window has document selector</li>\n<li>Feature: Alt or Option click a date to remove it</li>\n</ul>\n<h1 id=\"december-11\">December 11</h1>\n<ul>\n<li>Fix: Ensure that all emails added to a document are loaded</li>\n<li>Fix: Repeat dates were still showing incorrect dates in some cases</li>\n<li>Speed: Optimized performance of repeat dates. They temporarily show only the next 5 instances on the calendar.</li>\n</ul>\n<h1 id=\"december-10\">December 10</h1>\n<ul>\n<li>Fix: Durations on dates were not working right in some cases</li>\n<li>Fix: Settings were sometimes not syncing correctly</li>\n<li>Fix: Repeat dates were showing incorrect dates for users west of GMT</li>\n<li>Fix: Agenda was not filtering repeat dates for Today/Week/All correctly</li>\n</ul>\n<h1 id=\"december-9\">December 9</h1>\n<ul>\n<li>Change: Added extra steps to creating encryption password to prevent accidents</li>\n<li>Fix: Date picker works on mobile now</li>\n<li>Fix: Various loading issues</li>\n<li>Fix: Documents list was not updating immediately when documents added or removed remotely</li>\n</ul>\n<h1 id=\"december-8\">December 8</h1>\n<h3 id=\"release-of-new-backend\"><a href=\"/blog/new-backend\">Release of new backend</a></h3>\n<h1 id=\"september-27\">September 27</h1>\n<ul>\n<li>Fix: Some people were experiencing authorization bugs. Let us know if you continue to see any problems.</li>\n</ul>\n<h1 id=\"september-15\">September 15</h1>\n<ul>\n<li>Fix: Contact sync was broken by a bug in Google’s Contacts API so we rewrote it using their newer People API</li>\n<li>Fix: Selection was not being restored correctly after tabbing multiple items</li>\n<li>Fix: Copy was including children of collapsed items even if only one item was selected</li>\n<li>Fix: Backspacing into bold text was deleting the bold formatting at the end</li>\n</ul>\n<h1 id=\"august-27\">August 27</h1>\n<ul>\n<li>Fix: Improved authenticating plugins and added more automatic fixing of auth errors. This should fix bugs with plugins getting disabled, email/calendar sync problems, and alerts about missing authorization. If you see any of those alerts, clicking the authorize button in the alert should now fix any problems forever. If it doesn’t, please contact support and we will help you fix it.</li>\n<li>Fix: Move from Agenda was sometimes not working</li>\n<li>Fix: Moo.do works better in multiple tabs</li>\n<li>Fix: If current board is updated remotely, it is updated locally immediately</li>\n<li>Fix: Input going to pane if autocomplete was opened from a context menu</li>\n<li>Fix: Tabbing under a collapsed item would uncollapse it and have invalid selection</li>\n<li>Speed: Performance improvements during editing</li>\n<li>Speed: Delay search slightly if user has a lot of items so it doesn’t freeze while typing in search</li>\n</ul>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Scrolling was sometimes not working on iOS</li>\n<li>Fix: More improvements to typing</li>\n</ul>\n<h1 id=\"august-6\">August 6</h1>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Editing jumping around while typing</li>\n<li>Fix: Android: Keyboard toolbar would sometimes not close</li>\n</ul>\n<h1 id=\"august-4\">August 4</h1>\n<ul>\n<li>Feature: <strong>Multiple calendar accounts</strong>: Moo.do will now sync calendars from all of your accounts. Add more accounts in “Email Accounts” in the settings, and then you’ll see all calendars from all accounts in the “Google Calendar” settings.</li>\n<li>Feature: <strong>Create items on any calendar</strong>: There’s now an option in the new item popup to choose which calendar to add the item to.</li>\n<li>Feature: <strong>Move between calendars</strong>: If you click on an event in the calendar pane, there’s an option to change which calendar it’s on.</li>\n<li>Fix: Note header button works when no word is selected</li>\n</ul>\n<h1 id=\"august-1\">August 1</h1>\n<ul>\n<li>Fix: Prevent modifications of read-only calendar events</li>\n<li>Misc: Styled this changelog page better</li>\n</ul>\n<h1 id=\"july-30\">July 30</h1>\n<ul>\n<li>Feature: <strong>Default board view</strong>: Right click a board and set its default view. Then at any time later you can restore to that view. This is useful for being able to temporarily mess with a board and then get it back to normal.</li>\n<li>Change: Sidebar boards work more like toolbar boards: no more hover menu, right click for options, double click to rename.</li>\n<li>Fix: Email panes created from the board creator did not immediately load emails</li>\n</ul>\n<h1 id=\"july-29\">July 29</h1>\n<ul>\n<li>Feature: <strong>Automatic backups</strong>: There’s a new “Backups” page in the settings where you can enable backups and set a frequency. Then Moo.do will automatically backup all data into the “Moo.do Backups” folder in your Google Drive (only if there are any new changes to back up).</li>\n</ul>\n<h1 id=\"july-26\">July 26</h1>\n<ul>\n<li>Fix: Completing repeat dates was sometimes not immediately removing from agenda</li>\n</ul>\n<h1 id=\"july-25\">July 25</h1>\n<ul>\n<li>Fix: Dragging onto (no tag) block was replacing the tag with (no tag)</li>\n<li>Fix: Dropping onto an empty tag pane was moving the item to the pane’s zoomed item</li>\n<li>Fix: Tag and contact panes were not recalculating blocks when dragging between panes</li>\n</ul>\n<h1 id=\"july-24\">July 24</h1>\n<ul>\n<li>Change: Upgraded authentication system to Firebase Auth, to fix bugs and for the first step of the backend migration</li>\n</ul>\n<h1 id=\"july-22\">July 22</h1>\n<ul>\n<li>Fix: Help state sometimes did not sync properly across clients</li>\n</ul>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Feedback form did not have enough padding at the bottom of the screen</li>\n</ul>\n<h1 id=\"july-21\">July 21</h1>\n<ul>\n<li>Change: Pressing enter on a repeat date in an agenda date block now takes the block’s date instead of copying the repeat date</li>\n<li>Speed: Item updates from syncing calendar/email are now batched together, so they should be faster</li>\n<li>Fix: Shift + clicking collapsed items was scrolling to the top</li>\n<li>Fix: Error when pressing up in a multiline item on the agenda on an item with parents</li>\n<li>Fix: Pressing enter on a completed item in the agenda now just adds an item with the date of the block</li>\n<li>Fix: Pressing enter on a collapsed item in the agenda was not creating a new item</li>\n<li>Fix: Board/pane creation wizard: “Grouped by” was missing tags/contacts/priority views</li>\n</ul>\n<h1 id=\"july-20\">July 20</h1>\n<ul>\n<li>Change: Old versions of desktop apps will prompt you to update, because the old versions were not auto-updating correctly, and the latest versions have important fixes</li>\n<li>Fix: Sort mode of email panes was incorrectly initialized in new panes and could cause sorting by priority instead of date</li>\n<li>Fix: Selection highlight was not updating immediately in some cases</li>\n<li>Fix: Pasting single lines of text could sometimes be blocked in the Agenda</li>\n<li>Fix: Add buttons in Agenda on starred/important/tag blocks did not work correctly</li>\n<li>Fix: Tag blocks were case sensitive, so were missing items with tags that didn’t match the case</li>\n<li>Fix: Enter in tag block in pane was adding date instead of tag</li>\n</ul>\n<h1 id=\"july-19\">July 19</h1>\n<ul>\n<li>Fix: Item notes not syncing with Google Calendar</li>\n</ul>\n<h1 id=\"july-18\">July 18</h1>\n<ul>\n<li>Change: The “Complete” filter option now works like a normal filter (but reversed), because it was confusing that it worked differently than other filters, and new users got scared when items disappeared and couldn’t find the button to show them. When not enabled it shows everything, click hides completed, Cmd/Ctrl + click shows only completed. It’s set to hide completed by default, so new panes will have a red checkmark filter.</li>\n<li>Change: The “Show top level projects” filter to be the opposite: “Show all projects.” So by default project panes will only show top level projects, and the filter option will also show children. New users were confused that their projects were showing up more than once.</li>\n<li>Change: Filter buttons to be colored text instead of colored background, to reduce distraction.</li>\n<li>Fix: Clicking contact email populates the To field in an email. And clicking the phone number opens a phone call.</li>\n</ul>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Clicking items was sometimes not working on iOS 8 and 9</li>\n</ul>\n<h1 id=\"july-17\">July 17</h1>\n<ul>\n<li>Fix: Bugs in the authentication flow. If everything has been working fine for you, you should see no change. If you were having problems with plugins getting disabled, or emails not loading, or calendar not syncing correctly, you should now see a message about needing to reauthorize, and clicking the button will fix it. Please let us know if you see anything unusual, or if you’ve had these problems and they are not fixed now.</li>\n</ul>\n<h1 id=\"july-16\">July 16</h1>\n<ul>\n<li>Fix: Search was not handling text updates in other panes if pane was filtered but not searched</li>\n<li>Fix: Selection rendering could be offset incorrectly on items in agenda with multiple lines and context showing</li>\n<li>Fix: Only show message about items being hidden/completed once</li>\n<li>Fix: Selection not setting correctly when clicking after the + button in a project</li>\n</ul>\n<h1 id=\"july-15\">July 15</h1>\n<h3 id=\"version-1-1-4-of-desktop-apps-download\">Version 1.1.4 of desktop apps: <a href=\"/download/\">Download</a></h3>\n<ul>\n<li>Fix: Auto updater was not working for some users. If you are on an older version, please download this new version manually.</li>\n<li>Fix: Sync was going offline after a few hours for some users</li>\n</ul>\n<h1 id=\"july-14\">July 14</h1>\n<ul>\n<li>Feature: File drop zone is a button to enable Drive plugin if it is not enabled</li>\n<li>Change: Maximum sync weeks for Google Calendar to 52. Changing the value now updates calendar items immediately.</li>\n<li>Change: Renamed “Uncollapse” to “Expand”</li>\n</ul>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Change: Changed toggle collapse button to two buttons: one for collapse all and one for expand all</li>\n<li>Fix: Opening contact autocomplete in email To box when forwarding an email was sometimes crashing</li>\n<li>Fix: Context menu backdrop was not at the top on Android</li>\n</ul>\n<h1 id=\"july-13\">July 13</h1>\n<ul>\n<li>Fix: Dragging to overview was not working</li>\n<li>Fix: Custom calendar view was missing hotkey in add pane menu</li>\n<li>Fix: Calendar month view was not sorting times correctly</li>\n<li>Fix: Clicking on the text of a link after pasting it in could sometimes hit an error</li>\n</ul>\n<h1 id=\"july-12\">July 12</h1>\n<ul>\n<li>Fix: Better handling and notifications of connection errors caused by browser extensions.</li>\n<li>Speed: Performance improvements while typing in items. It should always be instant now.</li>\n</ul>\n<h1 id=\"july-10\">July 10</h1>\n<ul>\n<li>Blog: <a href=\"/blog/images/\">Full release of inline images</a></li>\n<li>Fix: Pane sometimes getting into a loop scrolling itself to the bottom</li>\n</ul>\n<h1 id=\"july-9\">July 9</h1>\n<h3 id=\"version-1-1-3-of-desktop-apps-download\">Version 1.1.3 of desktop apps: <a href=\"/download/\">Download</a></h3>\n<ul>\n<li>Fix: Application sometimes did not quit correctly on Windows</li>\n</ul>\n<h1 id=\"july-8\">July 8</h1>\n<ul>\n<li>Fix: Some improvements to editing and arrowing around images</li>\n<li>Speed: Performance improvements for search</li>\n<li>Speed: Performance improvements for tag autocomplete</li>\n</ul>\n<h1 id=\"july-5\">July 5</h1>\n<ul>\n<li>Feature: Image resizing. Grab the handle on the right side of an image to resize it.</li>\n</ul>\n<h1 id=\"july-4\">July 4</h1>\n<ul>\n<li>Change: Image context menus to include all the normal menu options</li>\n<li>Fix: Backspace after an image deletes the image correctly</li>\n</ul>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Tapping emails in Email pane was not working in some cases</li>\n</ul>\n<h1 id=\"july-3\">July 3</h1>\n<ul>\n<li>Change: Removed “Search expands collapsed” option now that we have new search expansion</li>\n<li>Fix: Calculation of number of unmatched items</li>\n</ul>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Input in date autocomplete was losing focus when pressing buttons</li>\n<li>Fix: Item checkboxes were preventing scroll</li>\n<li>Fix: Tapping on Overview items was sometimes not working</li>\n</ul>\n<h1 id=\"july-2\">July 2</h1>\n<ul>\n<li>Feature: Pasting and dropping images from the web will insert images inline if “Show images inline” setting is enabled</li>\n<li>Feature: Uploads go into the “Moo.do files” folder instead of the Drive root</li>\n<li>Fix: Improved editing around images</li>\n<li>Fix: Parsing of repeat dates with 3 letter abbreviations for Jun, Jul, Sep</li>\n<li>Fix: Parsing of 24 hour time was setting date to today</li>\n</ul>\n<h1 id=\"july-1\">July 1</h1>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Input in date autocomplete was losing focus when pressing date buttons</li>\n<li>Fix: Item checkboxes were preventing scroll</li>\n<li>Fix: Tapping on Overview items was sometimes not working</li>\n</ul>\n<h1 id=\"june-30\">June 30</h1>\n<ul>\n<li>Feature: Alt/option click a word/tag/date in search to remove it from search</li>\n<li>Fix: Incorrect search highlights sticking around</li>\n<li>Fix: Selection after double click was picking up the next word</li>\n<li>Fix: Copy sometimes selected the wrong text when copying text of a single item</li>\n<li>Fix: Tooltips were showing on tags and dates in search</li>\n</ul>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Add item button in blocks wasn’t working correctly</li>\n</ul>\n<h1 id=\"june-29\">June 29</h1>\n<ul>\n<li>Change: Search behaves more like other Outliner apps. Search collapsed state is an override on top of the normal state, and any user changes clear the override and set the normal value.</li>\n</ul>\n<h3 id=\"version-1-1-2-of-desktop-apps-download\">Version 1.1.2 of desktop apps: <a href=\"/download/\">Download</a></h3>\n<ul>\n<li>Fix: Importing Todoist and Wunderlist were opening in new windows</li>\n</ul>\n<h1 id=\"june-28\">June 28</h1>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Some bugs editing in Agenda</li>\n</ul>\n<h1 id=\"june-27\">June 27</h1>\n<ul>\n<li>Fix: A potential crash when loading an existing file into a fresh instance</li>\n</ul>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: + button in Agenda</li>\n</ul>\n<h1 id=\"june-25\">June 25</h1>\n<ul>\n<li>Feature: Select by word if selection started as a double click</li>\n<li>Fix: Todoist import with project hierarchy</li>\n<li>Fix: Issues with highlighting by mouse being incorrect when starting with a double click</li>\n</ul>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Change: Show Completed filter to have Show and Only options</li>\n<li>Fix: Offline support on iOS</li>\n</ul>\n<h1 id=\"june-24\">June 24</h1>\n<ul>\n<li>Feature: The message in empty panes has information about how many items are hidden by search and filters</li>\n<li>Fix: Copy of collapsed items losing indentation</li>\n<li>Fix: HTML elements * characters for bolding were appearing in breadcrumbs</li>\n<li>Fix: Don’t include * characters in tags</li>\n<li>Fix: HTML showing in tags</li>\n<li>Fix: Some editing errors around formatting characters</li>\n</ul>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Scrolling while dragging on iOS</li>\n</ul>\n<h3 id=\"version-1-1-1-of-desktop-apps-download\">Version 1.1.1 of desktop apps: <a href=\"/download/\">Download</a></h3>\n<ul>\n<li>Feature: Save and restore maximized and fullscreen state</li>\n<li>Fix: Memory leak and runaway process issues on Windows</li>\n<li>Fix: Linux installer sometimes did not work</li>\n</ul>\n<h1 id=\"june-23\">June 23</h1>\n<ul>\n<li>Feature: OPML import supports note attribute named “Notes”</li>\n<li>Fix: Email labelling menu was sometimes appending extra text to the label</li>\n<li>Fix: Checkboxes in Email pane are vertically centered</li>\n<li>Fix: Copy was losing hierarchy for children of the first selected item</li>\n<li>Fix: Item insert menu was not inserting items into the right place</li>\n</ul>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Release: New version of iOS app with the new filters, rich text notes and email composing, faster load and sync, and many bugs fixed</li>\n</ul>\n<h1 id=\"june-22\">June 22</h1>\n<ul>\n<li>Speed: Improved performance while typing in items with tags</li>\n<li>Fix: Tag autocomplete runs on tags in the whole File, not just visible in the pane</li>\n<li>Fix: Closing the introduction video was sometimes not working</li>\n</ul>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Hiding the top bar when switching to landscape while editing was sometimes not working</li>\n</ul>\n<h1 id=\"june-21\">June 21</h1>\n<ul>\n<li>Feature: Images in Google Drive can now be shown inline. Right click on a Drive file (that links to an image) and select “Show as image” to show it inline.</li>\n<li>Change: Dropping on a tag or contact block only replaces tag/contact if dropped from a corresponding block</li>\n<li>Change: Renamed “Delete Event” in item menu to “Remove from Google Calendar”</li>\n</ul>\n<h1 id=\"june-20\">June 20</h1>\n<ul>\n<li>Feature: Allow drag/dropping of Drive Folders</li>\n<li>Fix: Autocomplete sometimes overwriting emails/files</li>\n<li>Fix: Settings not being scrollable on small screens</li>\n<li>Fix: Errors when creating items in Calendar view synced to Google Calendar</li>\n<li>Fix: The “Delete” menu option on calendar items also deletes from Google Calendar</li>\n</ul>\n<h1 id=\"june-17\">June 17</h1>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Fix: Drag drop was sometimes not working right</li>\n<li>Fix: Completed filter was named incorrectly</li>\n<li>Fix: Loading and saving of collapsed state</li>\n<li>Fix: Dragging emails to drop bucket</li>\n<li>Fix: Items added from widget were not showing</li>\n</ul>\n<h1 id=\"june-16\">June 16</h1>\n<h3 id=\"mobile\">Mobile</h3>\n<ul>\n<li>Release: New version of Android app with the new filters, rich text notes and email composing, faster load and sync, and many bugx fixed</li>\n</ul>\n<h1 id=\"june-14\">June 14</h1>\n<ul>\n<li>Feature: Insert link menu is better at removing links: a button to remove the link, and can clear link or text</li>\n<li>Fix: Search in Drive pane wasn’t working right</li>\n<li>Fix: Search for emails and files in other panes too</li>\n<li>Fix: Search highlighting was sometimes buggy when searching for multiple small words</li>\n<li>Fix: Links were sometimes parsing at the wrong position in the text</li>\n</ul>\n<h1 id=\"june-13\">June 13</h1>\n<ul>\n<li>Feature: Added a - button to the formatting toolbar to collapse it to a small … button. There’s also a new setting in General settings to disable it completely.</li>\n<li>Feature: Select full items when multiple items are selected</li>\n<li>Change: Improved styling of agenda: reduced some padding, right aligned day number</li>\n<li>Fix: Insert link edits existing links better</li>\n<li>Fix: Overview was not collapsible in flat search</li>\n<li>Fix: Old style dates like @now could make typing slow</li>\n</ul>\n<h1 id=\"june-6\">June 6</h1>\n<ul>\n<li>Fix: Sometimes notes were not displaying previews</li>\n<li>Fix: Shift + Enter closes note editor</li>\n</ul>\n<h1 id=\"june-3\">June 3</h1>\n<ul>\n<li>Fix: Double insert of links from insert link menu</li>\n<li>Fix: Prefix showing on the last line of items in add item menu</li>\n<li>Fix: Crash pasting images</li>\n<li>Fix: Background of note field in add item menu in dark theme matches other fields</li>\n<li>Fix: Arrow keys in outline were broken by update earlier today</li>\n</ul>\n<h1 id=\"june-1\">June 1</h1>\n<ul>\n<li>Fix: Crash dragging a file from desktop onto a pane</li>\n</ul>\n<h2 id=\"may-31\">May 31</h2>\n<ul>\n<li>Fix: Pane rendering was wonky when manually resized and then opening an email preview</li>\n<li>Fix: Alt or Option clicking a date removes the whole date + duration, and works correctly when it spans multiple lines</li>\n<li>Fix: Items with durations in the agenda are draggable</li>\n</ul>\n<h2 id=\"may-26\">May 26</h2>\n<ul>\n<li>Change: Enter on an empty prefixed item does not remove the prefix</li>\n<li>Change: Add an icon next to file name in sidebar</li>\n<li>Change: Enter on an empty prefixed item <em>does</em> remove the prefix (as it did previously)</li>\n<li>Fix: Recursive collapse is instant now</li>\n<li>Fix: Delete selected toast hides after the normal 5 seconds</li>\n</ul>\n<h2 id=\"may-25\">May 25</h2>\n<ul>\n<li>Release: <a href=\"/blog/killer-task-management/\">Launch of new version</a></li>\n</ul>\n"}}}
