{"path":"blog/email-is-back","templateID":16,"sharedPropsHashes":{},"localProps":{"posts":[{"title":"Email is Back!","slug":"email-is-back","category":"updates","date":"Tue Dec 15 2020 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>We’ve got great news today! Moo.do’s email features are back in full force! We had to remove our Gmail sync <a href=\"/blog/chromeextension\">back in April</a> due to a change in Google’s policies, but we now have a new way to sync with Gmail that’s even better than it was before.</p>\n<p>Moo.do now does a full sync with Gmail in the new Email Pane (renamed from Inbox) which can pull in multiple Gmail accounts and has a unified All Accounts inbox. You can now reply to and forward your emails, and compose emails with any of your linked Gmail accounts. You can star, archive, and delete your emails right in Moo.do so you don’t need to switch apps. Moo.do now displays and composes emails using Gmail itself so it’s full-featured and familiar. Emails saved by the <a href=\"https://chrome.google.com/webstore/detail/moodo/dfphnckjoinkfflhfbnjoiggfflnekcb\">Chrome extension</a> or <a href=\"https://gsuite.google.com/marketplace/app/moodo/597847337936\">Gmail Add-On</a> will be listed under the Saved label in the Email Pane.</p>\n<p>The only downside is that Gmail sync does not work in the web version and requires the <a href=\"/download/\">desktop app</a>, but the web version’s Email Pane displays emails saved by the extension or add-on, and any emails saved into your documents will display correctly and open a Gmail tab on click.</p>\n<p>We believe it will be possible to add full sync with the mobile app and we will work on that next, but for now the mobile app has been updated to open emails using an embedded instance of Gmail, which is a better experience than our previous read-only preview and opening Gmail in a browser.</p>\n<h1 id=\"get-started\">Get started</h1>\n<p>The desktop apps should update themselves, but if they don’t or you want to download it, you can get it at <a href=\"https://www.moo.do/download/\">https://www.moo.do/download</a>. To get started with this new Gmail integration, open the Sync Plugins section of the settings and add your accounts to the new Gmail Accounts list at the top, then add an Email Pane.</p>\n<h1 id=\"want-outlook-support-\">Want Outlook support?</h1>\n<p>We may also be able to support sync with outlook.com using a similar method. If that is something you want, please let us know in our <a href=\"/beta/\">beta community</a> or <a href=\"mailto:support@moo.do\">email us</a>.</p>\n"}],"isSinglePost":true}}
