{"path":"blog/july-design","templateID":12,"sharedPropsHashes":{},"localProps":{"posts":[{"title":"July Design Update","slug":"july-design","category":"updates","date":"Fri Jul 28 2017 02:00:00 GMT+0200 (Central European Summer Time)","contents":"<p>This month we’ve been working with both new and power users to find pain points in our desktop UX. These updates include features for managing large documents, as well as making interactions more intuitive.</p>\n<img class=\"postImg postImgJulyDesign\" src=\"/blog/img/update-july-design.png\" />\n\n<h1 id=\"panes-search-and-collapsing\">Panes, search, and collapsing</h1>\n<ul>\n<li><b>Collapse All</b> now collapses every item rather than just those at the top level.</li>\n<li>Searching does not change the collapsed state of items. This means search will not expand everything to display matches.</li>\n<li>A new feature called <b>Flat Search</b> has been added. This shows only items that are a direct match, without showing the full hierarchy. Begin using <b>Flat Search</b> by clicking the <img class=\"postImgJulyFlat\" src=\"/blog/img/update-july-flat.png\" /> icon or using the hotkey (<span class=\"hotkeySec\"></span> + 6). Click the pencil icon to the left of a search result to see its full details.</li>\n</ul>\n<h1 id=\"sidebar\">Sidebar</h1>\n<ul>\n<li><b>Documents</b> have been renamed to <b>Files</b> for clarity of their purpose.</li>\n<li><b>Workspaces</b> have been renamed to <b>Boards</b> for clarity of their purpose.</li>\n<li>The sidebar is updated to make the relationship between <b>Files</b> and <b>Boards</b> more clear.</li>\n<li>The sidebar no longer fully hides, and instead shrinks to a very thin bar.</li>\n<li>Toggle the sidebar width by clicking the small arrow at the top, or by dragging its edge.</li>\n</ul>\n<h1 id=\"boards-previously-known-as-workspaces-\">Boards (previously known as Workspaces)</h1>\n<ul>\n<li><b>Boards</b> can be switched by clicking on them in the sidebar.</li>\n<li>Use the <span class=\"hotkeySec\"></span> + B hotkey to switch between <b>Boards</b> with arrow or number keys.</li>\n<li>The <b>Boards</b> list in the sidebar can be sorted with drag/drop.</li>\n</ul>\n<style>\n.postImgJulyDesign {\n    width: 500px;\n}\n.postImgJulyFlat {\n    width: 24px;\n    vertical-align: middle;\n    border: 1px solid #e6e6e6;\n    border-radius: 3px;\n    box-sizing: border-box;\n    margin: 0 4px;\n}\n</style>\n"}],"isSinglePost":true}}
