{"path":"blog/updates/13","templateID":16,"sharedPropsHashes":{},"localProps":{"posts":[{"title":"Recent Roadmap Changes","slug":"updated-roadmap","category":"updates","date":"Sat Jun 27 2015 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>We’ve spent the past month working on improving Moo.do’s performance, based on your feedback and to get ready for the Gmail and Google Calendar integrations. We found a way to dramatically improve Moo.do’s speed and load time, but the changes required ended up being larger than expected. The delay is totally worth it though, as Moo.do will soon be able to handle tens of thousands of items with ease and feel much snappier overall. This update will improve our apps on all platforms: web, Chrome, iOS, and Android.</p>\n<p>After this performance upgrade, we plan to spend some time working on some of the most requested features before starting the next big project that is the Gmail plugin.</p>\n<p>We want to be totally transparent about what we’re working on, and we know we haven’t been as good about that as we should be. So we’re going to post updates on our blog more often about what we’re doing and what is coming. To get that started, this is an overview of how we expect to spend the next few months:</p>\n<h2 id=\"upcoming-roadmap\">Upcoming roadmap</h2>\n<ul>\n<li>Finish the performance upgrade</li>\n<li>Important and highly requested features:<ul>\n<li>Google Calendar sync</li>\n<li>Improved search UI</li>\n<li>Improved Agenda: Making it directly editable, showing context of what list an item is in, showing the children of an item</li>\n<li>Notes</li>\n</ul>\n</li>\n<li>Start on Gmail plugin</li>\n</ul>\n"},{"title":"Google Drive and Premium","slug":"premium","category":"updates","date":"Wed May 06 2015 08:00:00 GMT+0800 (Singapore Standard Time)","uid":"launchPremium","contents":"<p>For the past six months since our public launch, we’ve focused on improving the free version of Moo.do, including what we believe are basic features that every productivity app needs to have for free: real-time collaboration, offline support, availability on every device, and no limits on usage. We really appreciate your feedback and support that has helped us shape Moo.do into a great tool for managing projects, tasks, and to-do lists. Now it’s time to make Moo.do into much more than just a to-do list app.</p>\n<p>Moo.do was started with the goal of organizing everything in one place. The first step of that was to be great at organizing one thing, so Moo.do has thus far been an app for organizing lists of text. We’ve spent the past few months building a plugin system that enables integration of all of the services you depend on into one organization system.</p>\n<h2 id=\"google-drive-integration\">Google Drive Integration</h2>\n<p>Today we’re launching Moo.do’s first plugin: Google Drive. You can view the entire contents of your Drive within Moo.do in the new Drive Pane, drag files or folders onto your lists, search and focus the Drive Panes on individual folders, and drag files from your computer right into your Moo.do lists. Drive files work just like any other text in Moo.do: you can prioritize, schedule, tag, complete, and star them.</p>\n<p>Try this live demo to see how the new Drive Pane works:</p>\n<div class=\"twoPane demobg\">\n    <div id=\"demoPremium\"></div>\n</div>\n\n<h2 id=\"premium\">Premium</h2>\n<p>Together with the Drive plugin, we’re launching our Premium plan. All of the features currently available in Moo.do will remain free, but premium users will have access to the new Drive plugin as well as <a href=\"https://www.moo.do/premium/\">many more Premium features</a> in the future. To celebrate the Premium launch, we have special Early Adopter pricing of $4.95 / month, a 30% discount from the regular price. If you sign up now, you get Early Adopter pricing for life! You can sign up for Premium and get discounts for inviting your friends from the settings menu in the desktop version of Moo.do.</p>\n<h2 id=\"discounts-for-inviting-friends\">Discounts for inviting friends</h2>\n<p>You get 20% off of your Premium plan for every friend you invite that signs up. You can stack that discount as many times as you want, so if 20 of your friends sign up for Moo.do, you’ll get 4 months for free! The friends you invite also get their first month of Moo.do Premium for free, so everyone wins :).</p>\n<h2 id=\"help-us-grow\">Help us grow</h2>\n<p>We really appreciate your support in becoming a Premium user and inviting your friends, which helps us get our new features and integrations into your hands as quickly as possible. Thank you!</p>\n\n\n<style>\n#post_launchPremium .demo {\n    display: block;\n    width: 100%;\n    height: 100%;\n}\n#post_launchPremium .demobg {\n    position: relative;\n    margin: 30px auto;\n    max-width: 100%;\n}\nhtml:not(.mobile) #post_launchPremium .demobg {\n    height: 440px;\n}\n#post_launchPremium .demobg:not(.demoimg) {\n    width: 100%;\n}\n#post_launchPremium .demoimg {\n    width: 100%;\n    display: block;\n}\n</style>","script":"window.__addDemo(\n{\n    id: 'demoPremium',\n    src: '/web/#demo=true&touch=false&data=blog-drive.0&panes=1:PaneDrive&dmode=0xB1',\n    img: '/img/ss/blog/premium/demoPremium.png'\n}\n);"},{"title":"Development Update 4/16","slug":"update-04-16","category":"updates","date":"Thu Apr 16 2015 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>We’ve been quiet recently while working on big new features for Moo.do, so we just wanted to update everyone on some recent changes and the roadmap for the next few months.</p>\n<h2 id=\"collapsing\">Collapsing</h2>\n<ul>\n<li>Collapsing is now per pane so that panes can be better used to focus on different areas of your lists.</li>\n<li>Collapsed state will now be saved when you switch documents.</li>\n<li>Search automatically expands collapsed items. Collapsing items while searched will not change their state outside of search.</li>\n</ul>\n<h2 id=\"upcoming-roadmap\">Upcoming roadmap</h2>\n<ul>\n<li>Google Drive integration (Premium)</li>\n<li>Performance upgrade on desktop and mobile</li>\n<li>Notes</li>\n<li>Notification settings</li>\n<li>International dates like DD/MM/YYYY or YYYY/MM/DD</li>\n<li>Gmail</li>\n</ul>\n"},{"title":"Moo.do & Mailbird","slug":"mailbird-launch","category":"updates","date":"Thu Mar 12 2015 08:00:00 GMT+0800 (Singapore Standard Time)","uid":"mailbird","contents":"<p>We just launched a deep integration with <a href=\"http://www.getmailbird.com\">Mailbird 2.0</a>, which is (in our humble opinions) the best email app for Windows. With Mailbird and Moo.do, email becomes a real to-do list that you can organize, prioritize, and schedule right alongside all your other projects and tasks.</p>\n<p><a href=\"http://www.getmailbird.com\"><img src=\"/img/mailbird.png\" /></a></p>\n<p>Moo.do is built into <a href=\"http://www.getmailbird.com\">Mailbird 2.0</a> as a dedicated sidebar, so you can drag your emails from Mailbird right into your Moo.do lists. It’s also an app inside Mailbird for a full-screen view of your Moo.do workflow. You can easily open emails from your task list: click an email in Moo.do and Mailbird opens it for you.</p>\n<p>Organizing email and tasks together has completely transformed the way we use email. We don’t have to manually write down emails that need follow up. We don’t miss important emails because we can prioritize and schedule them alongside our other tasks and appointments.</p>\n<p>We’re super excited about this integration with Mailbird and we hope it makes you less frustrated and more productive!</p>\n<p>Get Mailbird 2.0 at <a href=\"http://www.getmailbird.com\">http://www.getmailbird.com</a>.</p>\n<style>\n#post_mailbird img {\n    position: relative;\n    margin: 30px auto;\n    max-width: 100%;\n}\n</style>"},{"title":"Announcing Gmail and Drive Integration","slug":"announcing-email","category":"updates","date":"Wed Feb 25 2015 08:00:00 GMT+0800 (Singapore Standard Time)","uid":"announceEmail","contents":"<p>We are very happy to announce the next big step for Moo.do, and the reason we created Moo.do in the first place. You will soon be able to <strong>organize your email</strong> in Moo.do.</p>\n<h2 id=\"email\">Email</h2>\n<p>We are making Moo.do a full email application for Gmail and also integrating it into other email apps, starting with <a href=\"http://www.getmailbird.com\">Mailbird</a>, a fantastic email app for Windows.</p>\n<p>Emails work just like everything else in Moo.do: you can prioritize, schedule, tag, complete, and star your emails. Scheduled and prioritized emails show up in your agenda so you know what emails to deal with next. You can organize emails into your projects and put them right on your to-do lists. Search filters emails the same way as tasks, so it fits right into your workflow.</p>\n<div class=\"twoPane demobg\">\n    <div id=\"demoInboxZero\" class=\"noInteractive\"></div>\n</div>\n\n<h2 id=\"google-drive\">Google Drive</h2>\n<p>In addition to email, you can organize your Google Drive files and documents in your lists. If you drag a file from your computer into a Moo.do list, it will upload to Drive for you. Or if it’s already in Drive, Moo.do will find it and link to it.</p>\n<h2 id=\"mailbird\">Mailbird</h2>\n<p>Moo.do is built into <a href=\"http://www.getmailbird.com\">Mailbird 2.0</a> as a dedicated sidebar, so you can drag your emails from Mailbird right into your Moo.do lists. See more about Mailbird at <a href=\"http://getmailbird.com\">http://getmailbird.com</a>.</p>\n<h2 id=\"try-it-now\">Try it now</h2>\n<p>We’ve updated our <a href=\"http://www.moo.do/\">landing page</a> with live demos of how email and file organization work, so please try it out and let us know what you think!</p>\n\n\n<style>\n#post_announceEmail .demo {\n    display: block;\n    width: 100%;\n    height: 100%;\n}\n#post_announceEmail .demobg {\n    position: relative;\n    margin: 30px auto;\n    max-width: 100%;\n}\nhtml:not(.mobile) #post_announceEmail .demobg {\n    height: 560px;\n}\n\n#post_announceEmail .demobg:not(.demoimg) {\n    width: 100%;\n}\n#post_announceEmail .demoimg {\n    width: 100%;\n    display: block;\n}\n</style>","script":"window.__addDemo(\n{\n    id: 'demoInboxZero',\n    src: '/web/#demo=true&touch=false&data=intro.inbox.0&script=inboxZero&panes=PaneGmail:1&dmode=0xb9',\n    img: '/img/ss/pressInboxZero.png'\n}\n);\nfunction onMessageInboxZero(e)\n{\n    if(e.data === 'done')\n    {\n        document.getElementById('demoInboxZero').classList.remove('noInteractive');\n    }\n}\n\nwindow.addEventListener('message', onMessageInboxZero, false);"}],"numPages":15,"path":"/blog/updates"}}
