{"path":"blog/chromeextension","templateID":16,"sharedPropsHashes":{},"localProps":{"posts":[{"title":"Chrome Extension for Gmail","slug":"chromeextension","category":"updates","date":"Sat Apr 04 2020 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>Due to Google’s <a href=\"https://cloud.google.com/blog/products/g-suite/elevating-user-trust-in-our-api-ecosystems\">new policies</a> requiring apps that sync with Gmail and Drive to undergo extremely expensive and time-consuming security assessments, we are shifting our email syncing strategy (for now). Moo.do is now going to integrate into Gmail, instead of integrating Gmail into Moo.do.</p>\n<h1 id=\"chrome-extension\">Chrome Extension</h1>\n<p>Our new Chrome extension adds a button to the top of Gmail to select a Moo.do document, which will add the selected email to the top of that document. It also adds a button to the Chrome toolbar to add a link to the current page into Moo.do. You can install it at <a href=\"https://chrome.google.com/webstore/detail/moodo/dfphnckjoinkfflhfbnjoiggfflnekcb\">https://chrome.google.com/webstore/detail/moodo/dfphnckjoinkfflhfbnjoiggfflnekcb</a>.</p>\n<h1 id=\"gmail-add-on\">Gmail Add-On</h1>\n<p>This is still going through Google’s review so it’s not available yet, but it presents as a sidebar in Gmail to add the selected email to Moo.do. It even works in the Gmail mobile apps, which is very cool. We will update this post and post a new post when it’s ready.</p>\n<h1 id=\"we-re-google-verified-again\">We’re Google Verified again</h1>\n<p>This caught us very much by surprise as we’d been working with Google since August and making their suggested changes in order to not require the security assessment. But in February they said it was all for nothing, the security assessment would in fact be required, and immediately unverified Moo.do. So we have been scrambling to get verified again and find a new solution for integrating with Gmail. This extension and Add-On are still very basic just to get something out as quickly as possible, and we will continue to improve them and add more features. If you have any requests or suggestions, please <a href=\"mailto:contact@moo.do\">let us know</a> or join our <a href=\"https://www.moo.do/beta\">beta community</a>.</p>\n<h1 id=\"up-next\">Up next</h1>\n<p>We’ve been stuck entirely focused on this for almost two months, so now we can go back to normal. We are finishing a redesign of the Overview that has been in beta testing for a while, and we will focus mainly on bugfixing and stability.</p>\n"}],"isSinglePost":true}}
