{"path":"blog/mobile-speed","templateID":13,"sharedPropsHashes":{},"localProps":{"posts":[{"title":"Mobile Speed","slug":"mobile-speed","category":"updates","date":"Mon Dec 02 2019 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>We’ve spent the past month mostly focused on stability and heavily optimizing the mobile app. Let’s get right into the details!</p>\n<h1 id=\"mobile-app\">Mobile App</h1>\n<p>The iOS and Android apps now load much faster, especially for people with large documents. Large lists update much faster when typing and adding items, or when searching or filtering. There’s still more optimizations we can do, but this should be a big improvement for those of you with a lot of items. And we also fixed a good number of mobile bugs in general. If you’re still seeing any issues on mobile please let us know in our <a href=\"/beta\">beta community</a> or just <a href=\"mailto:support@moo.do\">email us</a>. We will continue to focus on the mobile app for a while, so it will keep getting better.</p>\n<h1 id=\"bug-fixes\">Bug fixes</h1>\n<p>We’ve fixed a ton of small bugs over the past month with a focus on plugin sync, so sync with Google services is much more stable now. We updated the Settings to combine the plugin settings screen with the Sync Accounts screen, which feels a lot more intuitive.</p>\n<p><img class=\"postImg postImgMobileSpeed\" src=\"/blog/img/update-mobile-speed.png\"></img></p>\n<h1 id=\"next\">Next</h1>\n<p>We are continuing to focus on stability in both the web and mobile apps, and starting on improving the introduction experience. See the <a href=\"/changelog\">changelog</a> for the full list of updates. If there’s any particular bug that’s been bothering you or a feature that could really help you, please let us know! The best way to do that is to join our <a href=\"/beta\">beta community</a> or just <a href=\"mailto:support@moo.do\">email us</a>.</p>\n<style>\n.postImgMobileSpeed {\n    width: 500px;\n}\n</style>"}],"isSinglePost":true}}
