{"path":"blog/performance","templateID":15,"sharedPropsHashes":{},"localProps":{"posts":[{"title":"Performance Upgrade","slug":"performance","category":"updates","date":"Mon Sep 14 2015 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>We just launched a <strong>huge</strong> performance upgrade for Moo.do which dramatically reduces load time and makes interaction feel much snappier. This update improves Moo.do everywhere: on the web, Chrome, iOS, and Android.</p>\n<p>We’re serious when we say this is a <strong>huge</strong> upgrade. Check it out:</p>\n<p>\n    <img class=\"postImg postImgPerf\" src=\"/blog/img/update-performance1.png\" />\n    <img class=\"postImg postImgPerf\" src=\"/blog/img/update-performance2.png\" />\n    <img class=\"postImg postImgPerf\" src=\"/blog/img/update-performance3.png\" />\n</p>\n\n<p>This update was an unexpected delay in our roadmap. As we got into the development of the Gmail plugin and began loading our inboxes into Moo.do, we realized we could not provide a good email experience until we fixed the performance problems. Moo.do was fast with a few hundred items, but as documents grew over time, Moo.do was unable to keep up. It was especially noticeable with the mobile apps, which were basically unusable with large documents. Adding large email inboxes into the mix made it clear that we had to focus on performance before we could continue.</p>\n<p>Now, Moo.do is snappy even with tens of thousands of items. And now that this big change is done, we’re back to building the features you’ve been waiting for. We have a new and much stronger foundation which is better designed for our future plans, so development will move much faster now.</p>\n<p>We did some cool things technically to make Moo.do this fast, which we will detail in a future post. So we’ll end this one with the usual list of things we’re working on next.</p>\n<h1 id=\"in-development\">In Development</h1>\n<ul>\n<li>Google Calendar sync</li>\n<li>Gmail integration</li>\n</ul>\n<style>\n.postImgPerf {\n    width: 682px;\n    margin: 40px auto;\n}\n</style>\n"}],"isSinglePost":true}}
