{"path":"blog/new-mobile-app","templateID":16,"sharedPropsHashes":{},"localProps":{"posts":[{"title":"New Mobile App","slug":"new-mobile-app","category":"updates","date":"Tue Dec 01 2020 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>We’ve been working for the past few months on bringing our web/desktop and mobile apps closer together, sharing more code so they can improve more quickly with fewer differences. And today we have an update to the mobile apps which brings tons of features as well as improved performance and stability, and opens up many more possibilities for future improvements.\n<br/><br/>\n<a href=\"https://itunes.apple.com/us/app/moo.do-organize-your-way/id889830074?ls=1&amp;mt=8\">Download iOS App 3.0.2</a></p>\n<p><a href=\"https://play.google.com/store/apps/details?id=moo.do\">Download Android App 5.0.1 (still in review)</a></p>\n<h1 id=\"what-s-new-on-mobile\">What’s new on mobile</h1>\n<ul>\n<li>Generally feels faster, smoother, and more stable</li>\n<li>Inbox Pane and Files Pane support</li>\n<li>Code blocks support</li>\n<li>The top bar works more like the web app, shrinking when you scroll down, and now has a back button.</li>\n<li>New date picker with easier repeat date selection</li>\n<li>All of the menus are now bottom sheets that go fullscreen if the keyboard is open. This makes it easier to quickly preview notes and dates without a full screen navigation.</li>\n<li>Autocomplete is now an inline popup instead of a new screen</li>\n<li>The mobile app now uses a board called “Mobile” which you can modify in the web/desktop version</li>\n<li>Improved load time, especially if you have large deleted documents</li>\n</ul>\n<h1 id=\"what-s-new-on-web-desktop\">What’s new on web/desktop</h1>\n<ul>\n<li>The same new date picker with easier repeat date selection</li>\n<li>Smoother scrolling while dragging at the top and bottom of panes</li>\n<li>Context menus and modal menus now trap tab focus, so tabbing is constrained into the menu</li>\n<li>Improved performance of animations: context menu and modal menu opening, panes, pane headers, and pane items</li>\n<li>Improved load time, especially if you have large deleted documents</li>\n</ul>\n<h1 id=\"details-of-the-new-mobile-app\">Details of the new mobile app</h1>\n<p>The new mobile app is now a mobile web app in a React Native wrapper. The <a href=\"/blog/inboxpane\">new pane/item rendering system</a> is so fast that load time and scrolling performance are actually better than the previous React Native app. The animations done with <a href=\"https://www.framer.com/motion/\">Framer Motion</a> are so smooth that they feel great even on very old phones.</p>\n<p>So now the mobile app shares the majority of the code with the web/desktop apps, except for the unique interface elements and slight differences in input. This means there is less surface area for potential bugs, and most new features and bug fixes will apply directly to all platforms, so we’ll be able to move much faster now!</p>\n<h1 id=\"what-s-next\">What’s next</h1>\n<p>We have no more big projects for a while. We’re going to focus on fixing bugs, adding small features, and making small design improvements. And we will keep adding more features to the mobile apps like supporting Calendar views, pane sort modes, multiple boards, widgets, etc…</p>\n<p>If you want to get involved in shaping Moo.do’s direction, join our active <a href=\"/beta/\">beta community</a> or just <a href=\"mailto:support@moo.do\">email us</a>.</p>\n"}],"isSinglePost":true}}
