{"path":"blog/launch","templateID":14,"sharedPropsHashes":{},"localProps":{"posts":[{"title":"Launch","slug":"launch","category":"updates","date":"Wed Sep 10 2014 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>We are proud to officially announce the launch of <strong>Moo.do</strong> at <a href=\"https://www.moo.do/\">https://moo.do</a> and on the <a href=\"https://itunes.apple.com/us/web/moo.do-organize-your-way/id889830074?ls=1&amp;mt=8\">iOS</a>, <a href=\"https://play.google.com/store/apps/details?id=moo.do\">Android</a>, and <a href=\"https://chrome.google.com/webstore/detail/moodo/iffimmolghilclfndeiebgppddmagofk\">Chrome</a> App Stores. <strong>Moo.do</strong> is designed to be the best and easiest way to organize everything in your life: projects, to-do lists, appointments, contacts, reminders, events, and anything else you can write down. As all modern apps should be, <strong>Moo.do</strong> is available on any computer, tablet, or phone and synchronizes all devices and users in realtime.</p>\n<p>Throughout the development process we have been using <strong>Moo.do</strong> as our only tool for <a href=\"/blog/public-beta\">planning, bug tracking, scheduling, and release tracking</a>. At the same time we have been using it to manage other projects, travel plans, and our day-to-day lives. Many of our beta testers have switched to using <strong>Moo.do</strong> as their primary organization system. Today we are happy to bring the power and simplicity of <strong>Moo.do</strong> to everyone.</p>\n<p>As of today <strong>Moo.do</strong> is accessible on the iOS, Android, and Chrome App Stores and as a full-featured web app at <a href=\"https://www.moo.do/\">https://moo.do</a>. Apps for Windows Phone, Windows 8, and Mac OS X will follow shortly.</p>\n<p>We hope that <strong>Moo.do</strong> will help you organize your life and keep you on track. If you have feedback, questions, or would like to request a feature - get in touch, we would love to help you out.</p>\n<p><a href=\"https://twitter.com/MooDoApp\">twitter.com/MooDoApp</a><br/>\n<a href=\"https://facebook.com/MooDoApp\">facebook.com/MooDoApp</a><br/>\n<a href=\"https://google.com/+MooDoApp\">google.com/+MooDoApp</a><br/>\n<a href=\"mailto:contact@moo.do\">contact@moo.do</a></p>\n"}],"isSinglePost":true}}
