{"path":"blog/updates","templateID":16,"sharedPropsHashes":{},"localProps":{"posts":[{"title":"Gmail Add-On","slug":"gmailaddon","category":"updates","date":"Sun May 10 2020 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>Moo.do’s Gmail Add-On is now available! It runs inside of Gmail in any browser, and even in the Gmail iOS and Android apps. This Add-On lets you save any email into a Moo.do document right from Gmail. You can install it into your Gmail account here: <a href=\"https://gsuite.google.com/marketplace/app/moodo/597847337936\">https://gsuite.google.com/marketplace/app/moodo/597847337936</a></p>\n<p>This is in addition to the Chrome extension announced in a <a href=\"/blog/chromeextension\">previous update</a>, which adds a button to the top of Gmail in Chrome. You can install that at <a href=\"https://chrome.google.com/webstore/detail/moodo/dfphnckjoinkfflhfbnjoiggfflnekcb\">https://chrome.google.com/webstore/detail/moodo/dfphnckjoinkfflhfbnjoiggfflnekcb</a>.</p>\n<p>If you have any requests or suggestions, please <a href=\"mailto:contact@moo.do\">let us know</a> or join our <a href=\"https://www.moo.do/beta\">beta community</a>.</p>\n<h1 id=\"up-next\">Up next</h1>\n<p>We have some big updates to the mobile apps on the way, fixing a lot of bugs and adding Dark mode. We’ll have another post about that shortly, and we’re continuing to focus mainly on bugfixing and stability.</p>\n"},{"title":"New Overview","slug":"overview","category":"updates","date":"Sun Apr 12 2020 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>Today’s update brings a new Overview design, which combines the previously separate Overview and Documents views into one hierarchy. So now all of your documents and overviews are in one place.</p>\n<p>This has actually been in <a href=\"/beta/\">beta testing</a> for almost two months now, and was put on hold because we had to urgently switch gears to make <a href=\"/blog/chromeextension\">the chrome extension</a>. Our beta testers have said this change has made the Overview much more useful for them, so we’re very excited to finally release it to everyone!</p>\n<p>So just click on the hamburger icon at the top of a pane to open the new Overview, which will hopefully be more powerful for you now.</p>\n"},{"title":"Chrome Extension for Gmail","slug":"chromeextension","category":"updates","date":"Sat Apr 04 2020 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>Due to Google’s <a href=\"https://cloud.google.com/blog/products/g-suite/elevating-user-trust-in-our-api-ecosystems\">new policies</a> requiring apps that sync with Gmail and Drive to undergo extremely expensive and time-consuming security assessments, we are shifting our email syncing strategy (for now). Moo.do is now going to integrate into Gmail, instead of integrating Gmail into Moo.do.</p>\n<h1 id=\"chrome-extension\">Chrome Extension</h1>\n<p>Our new Chrome extension adds a button to the top of Gmail to select a Moo.do document, which will add the selected email to the top of that document. It also adds a button to the Chrome toolbar to add a link to the current page into Moo.do. You can install it at <a href=\"https://chrome.google.com/webstore/detail/moodo/dfphnckjoinkfflhfbnjoiggfflnekcb\">https://chrome.google.com/webstore/detail/moodo/dfphnckjoinkfflhfbnjoiggfflnekcb</a>.</p>\n<h1 id=\"gmail-add-on\">Gmail Add-On</h1>\n<p>This is still going through Google’s review so it’s not available yet, but it presents as a sidebar in Gmail to add the selected email to Moo.do. It even works in the Gmail mobile apps, which is very cool. We will update this post and post a new post when it’s ready.</p>\n<h1 id=\"we-re-google-verified-again\">We’re Google Verified again</h1>\n<p>This caught us very much by surprise as we’d been working with Google since August and making their suggested changes in order to not require the security assessment. But in February they said it was all for nothing, the security assessment would in fact be required, and immediately unverified Moo.do. So we have been scrambling to get verified again and find a new solution for integrating with Gmail. This extension and Add-On are still very basic just to get something out as quickly as possible, and we will continue to improve them and add more features. If you have any requests or suggestions, please <a href=\"mailto:contact@moo.do\">let us know</a> or join our <a href=\"https://www.moo.do/beta\">beta community</a>.</p>\n<h1 id=\"up-next\">Up next</h1>\n<p>We’ve been stuck entirely focused on this for almost two months, so now we can go back to normal. We are finishing a redesign of the Overview that has been in beta testing for a while, and we will focus mainly on bugfixing and stability.</p>\n"},{"title":"Email/Password Signin","slug":"emailpassword","category":"updates","date":"Fri Feb 07 2020 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>Moo.do now supports email/password signin in addition to signing in with Google.</p>\n<p>In the “Moo.do Account” section of the Settings, you can manage which signin methods are linked to your account. New users can create an account with either email/password or Google. And for those of you who already signed in with Google, you can now:</p>\n<ol>\n<li>Link an email/password and sign in with either one</li>\n<li>Link email/password and then unlink from Google to just use email/password signin</li>\n<li>If you have email/password linked, you can unlink from Google and relink to easily change which Google account your Moo.do account is tied to (a common need when changing jobs)</li>\n<li>Ignore this and stick with Google signin</li>\n</ol>\n<p>Note: This is just a change to signin. Plugin authentication is not changed.</p>\n"},{"title":"Templates, Drag/Drop, and Hotkeys","slug":"templates","category":"updates","date":"Mon Jan 27 2020 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>It’s only been a week since our last post, but we’ve added a few big features, so here’s a quick update:</p>\n<h1 id=\"templates\">Templates</h1>\n<p>This feature, based on the Board Folders feature from <a href=\"/blog/2020\">the last update</a>, lets you save a Board Folder as a template which you can share publicly. The boards inside that folder and all the documents contained within them will be copied into a template and you’ll be given a URL that you can share to use that template.</p>\n<p>If you’d like, you can embed these templates in blog posts describing your workflow, or you can simply share the template itself. In the future we’ll add a way to install templates into your account as well as view/install counting to create a dashboard of the most popular templates. For now, please let us know what else you’d like to see out of this Templates feature.</p>\n<p>Note: Templates are a copy of all of the documents in those boards that does not stay in sync. You can update the template by saving it again.</p>\n<h1 id=\"multiselect-drag-drop\">Multiselect drag/drop</h1>\n<p>This has been requested for a long time, and we’re very excited to have finally released it! You can now highlight multiple items and drag/drop of all of them at once.</p>\n<h1 id=\"custom-hotkeys\">Custom Hotkeys</h1>\n<p>This has also been requested for a long time! There is a new page in the Settings to customize your hotkeys, where you can modify existing hotkeys or add new ones.</p>\n<h1 id=\"demo-of-features\">Demo of Features</h1>\n<p>Using the new templates system, we’ve set up a live demo at <a href=\"https://www.moo.do/demo/\">https://www.moo.do/demo/</a>. We will continue adding more helpful details and augmenting it with more boards showing how Moo.do works. If you have any suggestions for adding to it, please <a href=\"mailto:contact@moo.do\">let us know</a> or join our <a href=\"https://www.moo.do/beta\">beta community</a>.</p>\n"}],"numPages":14,"path":"/blog/updates"}}
