{"path":"blog","templateID":16,"sharedPropsHashes":{},"localProps":{"posts":[{"title":"Outlook Email Support","slug":"outlook","category":"updates","date":"Fri Jan 15 2021 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>Moo.do now supports syncing emails with Outlook email on both personal and 365 accounts. It works similarly to the new <a href=\"/blog/email-is-back\">Gmail integration</a> - just add your accounts in the “Sync Plugins” section of the settings. Then they will be available in the Email pane as well as for composing new emails.</p>\n<p>Like the new Gmail integration, this is only available in the <a href=\"/download/\">desktop app</a>, but the web version will show emails saved to documents and open outlook.com on click. The mobile apps can now open saved Outlook emails in-app.</p>\n<h1 id=\"chrome-extension-and-gmail-add-on\">Chrome Extension and Gmail Add-On</h1>\n<p>The Moo.do Chrome Extension now supports saving multiple emails at once in Gmail and both it and the Gmail Add-On have reduced the amount of email content they need to save.</p>\n<h1 id=\"get-started\">Get started</h1>\n<p>The desktop apps should update themselves, but if they don’t or you want to download it, you can get it at <a href=\"https://www.moo.do/download/\">https://www.moo.do/download</a>. The mobile apps will also update themselves to add support for opening Outlook emails in-app.</p>\n<h1 id=\"what-s-next\">What’s next</h1>\n<p>Full Gmail and Outlook sync on mobile is the next project on our todo list. But we’re also taking some time to work on bugs and small features. If there’s anything you’d like to see fixed or added, please <a href=\"mailto:contact@moo.do\">let us know</a> or join our <a href=\"https://www.moo.do/beta\">beta community</a>.</p>\n"},{"title":"Email is Back!","slug":"email-is-back","category":"updates","date":"Tue Dec 15 2020 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>We’ve got great news today! Moo.do’s email features are back in full force! We had to remove our Gmail sync <a href=\"/blog/chromeextension\">back in April</a> due to a change in Google’s policies, but we now have a new way to sync with Gmail that’s even better than it was before.</p>\n<p>Moo.do now does a full sync with Gmail in the new Email Pane (renamed from Inbox) which can pull in multiple Gmail accounts and has a unified All Accounts inbox. You can now reply to and forward your emails, and compose emails with any of your linked Gmail accounts. You can star, archive, and delete your emails right in Moo.do so you don’t need to switch apps. Moo.do now displays and composes emails using Gmail itself so it’s full-featured and familiar. Emails saved by the <a href=\"https://chrome.google.com/webstore/detail/moodo/dfphnckjoinkfflhfbnjoiggfflnekcb\">Chrome extension</a> or <a href=\"https://gsuite.google.com/marketplace/app/moodo/597847337936\">Gmail Add-On</a> will be listed under the Saved label in the Email Pane.</p>\n<p>The only downside is that Gmail sync does not work in the web version and requires the <a href=\"/download/\">desktop app</a>, but the web version’s Email Pane displays emails saved by the extension or add-on, and any emails saved into your documents will display correctly and open a Gmail tab on click.</p>\n<p>We believe it will be possible to add full sync with the mobile app and we will work on that next, but for now the mobile app has been updated to open emails using an embedded instance of Gmail, which is a better experience than our previous read-only preview and opening Gmail in a browser.</p>\n<h1 id=\"get-started\">Get started</h1>\n<p>The desktop apps should update themselves, but if they don’t or you want to download it, you can get it at <a href=\"https://www.moo.do/download/\">https://www.moo.do/download</a>. To get started with this new Gmail integration, open the Sync Plugins section of the settings and add your accounts to the new Gmail Accounts list at the top, then add an Email Pane.</p>\n<h1 id=\"want-outlook-support-\">Want Outlook support?</h1>\n<p>We may also be able to support sync with outlook.com using a similar method. If that is something you want, please let us know in our <a href=\"/beta/\">beta community</a> or <a href=\"mailto:support@moo.do\">email us</a>.</p>\n"},{"title":"New Mobile App","slug":"new-mobile-app","category":"updates","date":"Tue Dec 01 2020 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>We’ve been working for the past few months on bringing our web/desktop and mobile apps closer together, sharing more code so they can improve more quickly with fewer differences. And today we have an update to the mobile apps which brings tons of features as well as improved performance and stability, and opens up many more possibilities for future improvements.\n<br/><br/>\n<a href=\"https://itunes.apple.com/us/app/moo.do-organize-your-way/id889830074?ls=1&amp;mt=8\">Download iOS App 3.0.2</a></p>\n<p><a href=\"https://play.google.com/store/apps/details?id=moo.do\">Download Android App 5.0.1</a></p>\n<h1 id=\"what-s-new-on-mobile\">What’s new on mobile</h1>\n<ul>\n<li>Generally feels faster, smoother, and more stable</li>\n<li>Inbox Pane and Files Pane support</li>\n<li>Code blocks support</li>\n<li>The top bar works more like the web app, shrinking when you scroll down, and now has a back button.</li>\n<li>New date picker with easier repeat date selection</li>\n<li>All of the menus are now bottom sheets that go fullscreen if the keyboard is open. This makes it easier to quickly preview notes and dates without a full screen navigation.</li>\n<li>Autocomplete is now an inline popup instead of a new screen</li>\n<li>The mobile app now uses a board called “Mobile” which you can modify in the web/desktop version</li>\n<li>Improved load time, especially if you have large deleted documents</li>\n</ul>\n<h1 id=\"what-s-new-on-web-desktop\">What’s new on web/desktop</h1>\n<ul>\n<li>The same new date picker with easier repeat date selection</li>\n<li>Smoother scrolling while dragging at the top and bottom of panes</li>\n<li>Context menus and modal menus now trap tab focus, so tabbing is constrained into the menu</li>\n<li>Improved performance of animations: context menu and modal menu opening, panes, pane headers, and pane items</li>\n<li>Improved load time, especially if you have large deleted documents</li>\n</ul>\n<h1 id=\"details-of-the-new-mobile-app\">Details of the new mobile app</h1>\n<p>The new mobile app is now a mobile web app in a React Native wrapper. The <a href=\"/blog/inboxpane\">new pane/item rendering system</a> is so fast that load time and scrolling performance are actually better than the previous React Native app. The animations done with <a href=\"https://www.framer.com/motion/\">Framer Motion</a> are so smooth that they feel great even on very old phones.</p>\n<p>So now the mobile app shares the majority of the code with the web/desktop apps, except for the unique interface elements and slight differences in input. This means there is less surface area for potential bugs, and most new features and bug fixes will apply directly to all platforms, so we’ll be able to move much faster now!</p>\n<h1 id=\"what-s-next\">What’s next</h1>\n<p>We have no more big projects for a while. We’re going to focus on fixing bugs, adding small features, and making small design improvements. And we will keep adding more features to the mobile apps like supporting Calendar views, pane sort modes, multiple boards, widgets, etc…</p>\n<p>If you want to get involved in shaping Moo.do’s direction, join our active <a href=\"/beta/\">beta community</a> or just <a href=\"mailto:support@moo.do\">email us</a>.</p>\n"},{"title":"Normal and Global Search","slug":"search","category":"updates","date":"Fri Jul 24 2020 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>Many of our users have been requesting better ways to search for items, and the new list system from <a href=\"/blog/inboxpane\">the recent big update</a> has made it much easier. So for this update we focused on being able to find and open items more easily, and we’ve got two new search methods for you.</p>\n<h1 id=\"normal-search\">Normal Search</h1>\n<p>This normal search feature works as you’d expect. Press <span class=\"hotkey\"><span class=\"hotkeyPri\"></span> + F</span> to open search, and it scrolls to the results.</p>\n<h1 id=\"global-search\">Global Search</h1>\n<p>Press <span class=\"hotkey\"><span class=\"hotkeyPri\"></span> + Shift + F</span> or <span class=\"hotkey\"><span class=\"hotkeyPri\"></span> + P</span> to open the new Global Search, which searches for items across all documents and has many options for opening the selected item:</p>\n<ul>\n<li>Click or press enter to zoom to the document’s root and scroll to the item</li>\n<li>Hold Shift to zoom into the item instead of scrolling to it (and modifies the other options)</li>\n<li>Hold <span class=\"hotkey\"><span class=\"hotkeyPri\"></span></span> to open it a new pane</li>\n<li>Hold <span class=\"hotkey\"><span class=\"hotkeySec\"></span></span> to open it in a popup</li>\n</ul>\n"},{"title":"Authentication and Code Blocks","slug":"codeblocks","category":"updates","date":"Fri Jul 24 2020 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<h1 id=\"new-authentication\">New Authentication</h1>\n<p>The way we were doing authentication with Google had been working great for a long time, but then it started reporting accounts as not signed in and would not authenticate anymore, so we had to show a message asking to reauthenticate. The incidents of these errors happening increased over time until it affected almost everybody, for some reason. So we’ve switched to a more reliable authentication method.</p>\n<p>We’re now doing server-side Google plugin authentication, saving refresh tokens in the database so Moo.do’s backend can authenticate you, instead of depending on Google’s client-side authentication. This should now stop asking for reauthentication and also not require authenticating again on every device.</p>\n<p>Moo.do will continue to use the old method as long as it works for you, but if you reauthenticate it will use the new method and should fix this for good. If you prefer to use the old method for some reason, you can disable “Use new authentication” in the General settings.</p>\n<p><strong>Technical details:</strong> We had liked the security benefit of client-side authentication because then our server could not access your accounts, so we’ve come up with a new secure method for server-side authentication. Part of the refresh token is encrypted on the user account and inaccessible to the server, while the other part is in an area that only the server can access. This way the server cannot access your accounts by itself - it needs the client app to send the other part of the refresh token in order to create a new authentication token.</p>\n<h1 id=\"code-blocks\">Code Blocks</h1>\n<p>The <a href=\"/blog/inboxpane\">previous update</a> opened up a lot more flexibility in how we display items, so we’re now able to add this highly requested feature of code blocks.</p>\n<p>Code Blocks can be created by starting an item with <span class=\"hotkey\">``` + Space</span> or select it from the / help menu. It will try to automatically detect the language as you type, or you can select the language from the menu. Editing works differently inside a code block: Enter creates a new line in the code block, and <span class=\"hotkey\"><span class=\"hotkeyPri\"></span> + A</span> selects the whole code block (the first time).</p>\n<p><img class=\"postImg\" src=\"/blog/img/update-code-blocks.png\"></img></p>\n<p>If you have any requests for improving the code blocks (or anything else) please let us know <a href=\"https://www.moo.do/beta/\">in our beta group</a> or at <a href=\"mailto:contact@moo.do\">contact@moo.do</a>.</p>\n"}],"numPages":16,"path":"/blog","showChangelog":true}}
