{"path":"blog/calendar-pane","templateID":12,"sharedPropsHashes":{},"localProps":{"posts":[{"title":"Calendar Pane (Beta)","slug":"calendar-pane","category":"updates","date":"Sun Feb 19 2017 01:00:00 GMT+0100 (CET)","contents":"<p>Moo.do now has a full Calendar! The new Calendar Pane has the original Agenda view as well as Day, Week, and Month views.</p>\n<img class=\"postImg postImgUpdateCalendarPane\" src=\"/img/about/CalendarPane.gif\" />\n\n<p>While we love the Agenda view for an overview of what’s next, it is much easier to schedule and manage tasks, appointments, and emails on a calendar.</p>\n<h1 id=\"moo-do-tasks-google-calendar\">Moo.do tasks + Google Calendar</h1>\n<p>Combined with the Google Calendar integration, the Calendar Pane shows Moo.do tasks as well as appointments from Google Calendar. Moo.do and Google Calendar synchronize in both directions, so you can manage your calendar with Moo.do as well as work with your Moo.do events from other Calendar apps.</p>\n<h1 id=\"calendar-item-context\">Calendar item context</h1>\n<p>Clicking an item in the calendar opens a new item details popup, which shows breadcrumbs for its parents, notes, and children.\n<img class=\"postImg postImgUpdateCalendarPane2\" src=\"/blog/img/update-calendar-pane.png\" /></p>\n<h1 id=\"zoom-and-search-calendar\">Zoom and search Calendar</h1>\n<p>Search in the Calendar is the same as in other panes, so you can zoom the Calendar into a project and search for tags or other details, or show only high priority events.</p>\n<h1 id=\"premium\">Premium</h1>\n<p>Users of the free version of Moo.do will continue to have the Agenda, but the new Day, Week, and Month views are part of Moo.do Premium.</p>\n<h1 id=\"help-us-improve\">Help us improve</h1>\n<p>This is an Early Access release, meaning we want your feedback to get this feature right. Please let us know how you use the Calendar pane and how we can improve it for you. Thank you!</p>\n<style>\n.postImgUpdateCalendarPane {\n    width: 900px;\n    margin: 40px auto;\n    box-shadow: none;\n}\n.postImgUpdateCalendarPane2 {\n    width: 500px;\n    margin: 40px auto;\n}\n</style>\n"}],"isSinglePost":true}}
