{"path":"blog/updates/9","templateID":16,"sharedPropsHashes":{},"localProps":{"posts":[{"title":"Pricing/Trial Update","slug":"pricing","category":"updates","date":"Wed Apr 27 2016 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>As the Gmail plugin comes out of Beta, we will be switching from Early Adopter pricing to the normal price of $7 / month and we will also begin offering a yearly pricing option of $70 / year. We want to give our current users time to trial our Premium features before going Premium which is available by going to the Settings menu in the desktop app.</p>\n<p>The change in price will happen in two weeks on <strong>May 10th</strong>. As thanks for helping us grow in our early days, anyone that signs up for Premium before that date will continue to have Early Adopter pricing for life.</p>\n<p>Before the Gmail plugin comes out of Beta we are trying to squash any remaining bugs. If you’ve noticed anything strange or are seeing any issues, please let us know and we will fix them for you. Thank you!</p>\n"},{"title":"Gmail Plugin Public Beta","slug":"gmail-public-beta","category":"updates","date":"Mon Apr 11 2016 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<h1 id=\"free-trial-for-everyone-\">Free trial for everyone!</h1>\n<p>We are introducing a 14 day free trial of Moo.do Premium which will start the next time that you login to Moo.do. With the trial you have full access to the Gmail, Google Calendar, and Google Drive plugins. Get started using the Premium plugins in the Settings menu on a desktop app/browser.</p>\n<h1 id=\"gmail-plugin\">Gmail plugin</h1>\n<p>Moo.do’s Gmail plugin is now in open beta as part of our Early Access program for Premium and Trial members. You can now use Moo.do to read, write, organize, and schedule your emails right next to your events, tasks, and files.</p>\n<img class=\"postImg postImgGmailPublic\" src=\"/blog/img/update-gmail-public.gif\" />\n\n<h1 id=\"gmail-plugin-in-development\">Gmail plugin in development</h1>\n<p>We are continuing to add features to the Gmail plugin. Let us know if there’s any particular email features that you’d like to see in Moo.do.</p>\n<style>\n.postImgGmailPublic {\n    margin: 40px auto;\n    width: 700px;\n}\n</style>\n"},{"title":"Notes","slug":"notes","category":"updates","date":"Tue Apr 05 2016 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>As we are putting the final touches on the Gmail plugin we are releasing a much requested feature - Notes! With notes you can easily add more context and information to items without cluttering your outline. Notes display with a preview of their first line as small gray text under an item.</p>\n<img class=\"postImg postImgNotes postImgNotesSmall\" src=\"/blog/img/update-notes1.png\" />\n\n<p>You can click on a note or press Shift + Enter to open the note editor where you can write notes as long as you would like.</p>\n<img class=\"postImg postImgNotes postImgNotesSmall\" src=\"/blog/img/update-notes2.png\" />\n<img class=\"postImg postImgNotes postImgNotesBig\" src=\"/blog/img/update-notes3.png\" />\n\n<p>Notes are currently plain text, but we would like to make a more powerful rich note editor in the future. If you have any feedback or suggestions about what you’d like to see from Notes, we’d love to hear from you!</p>\n<style>\n.postImgNotesSmall {\n    height: 58px;\n    width: auto;\n}\n.postImgNotesBig {\n    width: 700px;\n}\n.postImgNotes {\n    margin: 40px auto;\n}\n</style>\n"},{"title":"Outline Upgrade","slug":"new-overview","category":"updates","date":"Sat Mar 19 2016 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>We’ve redesigned the Outline to make it easier to navigate large documents and renamed it to “Overview.” The new Overview is a companion that opens next to a pane for a top level view of your lists. As you scroll your list it highlights and tracks your position in the document. Clicking any item in the Overview will scroll to it and dragging items onto the Overview moves them to the list they are dropped on.</p>\n<p><a href=\"/blog/img/update-overview1.png\" target=\"_blank\"><img class=\"postImg postImgOutline\" src=\"/blog/img/update-overview1.png\" /></a></p>\n<p>This is an important change for the Gmail plugin. The new Overview provides easy access to Gmail labels and allows you to quickly drag emails onto the Overview to label them and move them out of the Inbox.</p>\n<img class=\"postImg postImgOutline\" src=\"/blog/img/update-overview2.gif\" />\n\n<p>More updates on the Gmail plugin coming soon!</p>\n<style>\n.postImgOutline {\n    margin: 40px auto;\n}\n</style>\n"},{"title":"Moo.do for Gmail Coming Soon","slug":"gmail-preview","category":"updates","date":"Fri Mar 11 2016 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>The Gmail plugin for Moo.do is nearing public beta! Moo.do will soon be a full desktop email client. You’ll be able to use Moo.do to read, write, organize, and schedule your emails right next to your events, tasks, and files.</p>\n<p>We have gotten a lot of great feedback from our private beta testers which has helped shape Moo.do into what we think is a great tool for working with email. We’re super excited about this and are working to get the Gmail plugin ready for you as quickly as possible. Here’s a quick preview of how email looks inside Moo.do.</p>\n<p><a href=\"/blog/img/update-gmail-preview.png\" target=\"_blank\"><img class=\"postImg postImgGmailPreview\" src=\"/blog/img/update-gmail-preview.png\" /></a></p>\n<p>More updates on the Gmail plugin coming soon!</p>\n<style>\n.postImgGmailPreview {\n    width: 100%;\n    margin: 40px auto;\n}\n</style>\n"}],"numPages":14,"path":"/blog/updates"}}
