{"path":"blog/updates/2","templateID":16,"sharedPropsHashes":{},"localProps":{"posts":[{"title":"Authentication and Code Blocks","slug":"codeblocks","category":"updates","date":"Fri Jul 24 2020 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<h1 id=\"new-authentication\">New Authentication</h1>\n<p>The way we were doing authentication with Google had been working great for a long time, but then it started reporting accounts as not signed in and would not authenticate anymore, so we had to show a message asking to reauthenticate. The incidents of these errors happening increased over time until it affected almost everybody, for some reason. So we’ve switched to a more reliable authentication method.</p>\n<p>We’re now doing server-side Google plugin authentication, saving refresh tokens in the database so Moo.do’s backend can authenticate you, instead of depending on Google’s client-side authentication. This should now stop asking for reauthentication and also not require authenticating again on every device.</p>\n<p>Moo.do will continue to use the old method as long as it works for you, but if you reauthenticate it will use the new method and should fix this for good. If you prefer to use the old method for some reason, you can disable “Use new authentication” in the General settings.</p>\n<p><strong>Technical details:</strong> We had liked the security benefit of client-side authentication because then our server could not access your accounts, so we’ve come up with a new secure method for server-side authentication. Part of the refresh token is encrypted on the user account and inaccessible to the server, while the other part is in an area that only the server can access. This way the server cannot access your accounts by itself - it needs the client app to send the other part of the refresh token in order to create a new authentication token.</p>\n<h1 id=\"code-blocks\">Code Blocks</h1>\n<p>The <a href=\"/blog/inboxpane\">previous update</a> opened up a lot more flexibility in how we display items, so we’re now able to add this highly requested feature of code blocks.</p>\n<p>Code Blocks can be created by starting an item with <span class=\"hotkey\">``` + Space</span> or select it from the / help menu. It will try to automatically detect the language as you type, or you can select the language from the menu. Editing works differently inside a code block: Enter creates a new line in the code block, and <span class=\"hotkey\"><span class=\"hotkeyPri\"></span> + A</span> selects the whole code block (the first time).</p>\n<p><img class=\"postImg\" src=\"/blog/img/update-code-blocks.png\"></img></p>\n<p>If you have any requests for improving the code blocks (or anything else) please let us know <a href=\"https://www.moo.do/beta/\">in our beta group</a> or at <a href=\"mailto:contact@moo.do\">contact@moo.do</a>.</p>\n"},{"title":"Normal and Global Search","slug":"search","category":"updates","date":"Fri Jul 24 2020 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>Many of our users have been requesting better ways to search for items, and the new list system from <a href=\"/blog/inboxpane\">the recent big update</a> has made it much easier. So for this update we focused on being able to find and open items more easily, and we’ve got two new search methods for you.</p>\n<h1 id=\"normal-search\">Normal Search</h1>\n<p>This normal search feature works as you’d expect. Press <span class=\"hotkey\"><span class=\"hotkeyPri\"></span> + F</span> to open search, and it scrolls to the results.</p>\n<h1 id=\"global-search\">Global Search</h1>\n<p>Press <span class=\"hotkey\"><span class=\"hotkeyPri\"></span> + Shift + F</span> or <span class=\"hotkey\"><span class=\"hotkeyPri\"></span> + P</span> to open the new Global Search, which searches for items across all documents and has many options for opening the selected item:</p>\n<ul>\n<li>Click or press enter to zoom to the document’s root and scroll to the item</li>\n<li>Hold Shift to zoom into the item instead of scrolling to it (and modifies the other options)</li>\n<li>Hold <span class=\"hotkey\"><span class=\"hotkeyPri\"></span></span> to open it a new pane</li>\n<li>Hold <span class=\"hotkey\"><span class=\"hotkeySec\"></span></span> to open it in a popup</li>\n</ul>\n"},{"title":"Inbox Pane and List Changes","slug":"inboxpane","category":"updates","date":"Wed Jul 08 2020 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>This is the biggest single update we’ve ever released, so strap in! This has been in <a href=\"https://www.moo.do/beta/\">beta testing</a> for almost 7 weeks now, because its core is a full rewrite of the pane and item rendering, and we wanted to make sure it’s totally stable before releasing it to everyone. We started this project in order to make the new Inbox Pane, but it expanded to include a lot of nice features and bugfixes.</p>\n<p>The heart of this update is a brand new virtualized windowing list for pane and item rendering. The old list depended on manually measuring and sizing text, which imposed a lot of constraints. This new system removes all of the constraints and is much more flexible, laying the groundwork for a lot more flexibility, lots of bugfixes, and future features.</p>\n<p>Now let’s get into it!</p>\n<h1 id=\"inbox-pane\">Inbox Pane</h1>\n<p>This is a new pane type which shows all of the emails saved by the <a href=\"https://chrome.google.com/webstore/detail/moodo/dfphnckjoinkfflhfbnjoiggfflnekcb\">Chrome Extension</a> and <a href=\"https://gsuite.google.com/marketplace/app/moodo/597847337936\">Gmail Add-On</a>. Due to <a href=\"/blog/chromeextension\">Google’s new policies</a> we have to remove the Gmail plugin, so this is our new Gmail integration strategy moving forward. With the extension or add-on, you can save emails to Moo.do from within Gmail and manage those saved emails with the Inbox Pane, where you move them around documents as you like.</p>\n<h1 id=\"significant-changes\">Significant changes</h1>\n<h2 id=\"pane-headers\">Pane Headers</h2>\n<p>Documents now display a big bold heading at the top, which shrinks when you scroll down. This makes it easier to quickly see which document and breadcrumbs you’re zoomed into, and to navigate back up the zoomed tree. You can click on the document name to change documents, and the heading now includes a preview of the notes of the zoomed item.</p>\n<p>The search bar is smaller down on the right and expands if it needs to. The top row of the header now shows individual buttons for changing view modes and sorts. Many new users had not been finding all of the view options, and this also makes it easier to quickly change views.</p>\n<p><img class=\"postImg\" src=\"/blog/img/update-inbox-pane.png\"></img></p>\n<h2 id=\"indent-alignment\">Indent Alignment</h2>\n<p>Indent levels are now aligned to the text instead of the prefix. This may be jarring at first, but we and our <a href=\"https://www.moo.do/beta/\">beta testers</a> have found it to be more intuitive and readable after getting used to it. If you prefer the old way, there’s an option in the Display Settings.</p>\n<h2 id=\"indenting\">Indenting</h2>\n<p>Pressing <span class=\"hotkey\">Tab</span> or <span class=\"hotkey\">Shift + Tab</span> now indents the item and its subtree, because it’s usually much more useful for outlining. If you want to move just the one item in and out, you can do that with <span class=\"hotkey\"><span class=\"hotkeyPri\"></span> + [</span> and <span class=\"hotkey\"><span class=\"hotkeyPri\"></span> + ]</span>.</p>\n<h2 id=\"selection\">Selection</h2>\n<p>Selecting across multiple items now selects the full items and their subtrees instead of the raw cursor selection. This may also feel jarring at first, but feels more useful for outlining purposes.</p>\n<h2 id=\"display-changes\">Display changes</h2>\n<ul>\n<li>The menu icon to the left of items is removed because it didn’t really do anything and was a poor use of space as it just did the same thing as right clicking. Many people had thought those were drag handles, but you can actually drag from anywhere to the left of the text.</li>\n<li>Agenda times are now on the right side so it doesn’t have to add so much padding on the left.</li>\n<li>Removed the checkmark on the right side so that space can be used for agenda times or other features in the future.</li>\n</ul>\n<h1 id=\"significant-improvements\">Significant Improvements</h1>\n<h2 id=\"font-options\">Font Options</h2>\n<p>You can now choose the display font in the Display Settings. It defaults to San Francisco on Mac, Segoe UI on Windows, and Noto Sans on Linux, but there’s lots of options for each platform. These generally look much better than the old fonts, and if you have any fonts you’d like to use please let us know. We’ve also added additional settings for the default font weight and color of numbered lists.</p>\n<h2 id=\"text-formatting\">Text formatting</h2>\n<p>Formatting of text was previously a bit wonky in some cases. It is completely flawless now (but please let us know if you do find a flaw). Entering Markdown characters with the “Show Markdown” option disabled now treats them as regular text, so typing * or _ won’t break your text anymore.\nTons of bugs around formatting are fixed, including searching for text that had formats in it, formatting around prefixes, pressing enter in the middle of formatted text, etc…</p>\n<h2 id=\"paste\">Paste</h2>\n<p>We rewrote the paste system from scratch and it works significantly better now. It does a much better job of including images, retaining the correct hierarchy, and supports pasting OPML.</p>\n<h2 id=\"undo-redo\">Undo / Redo</h2>\n<p>Undo and redo is generally more stable and restores selection better. Multiple changes are batched together in more cases so you don’t have to undo multiple times.</p>\n<h2 id=\"search-for-dates\">Search for dates</h2>\n<p>Many bugs in searching for dates are fixed, and some new features are added. You can now search for <span class=\"hotkey\">date: any</span> to match items with any date, or <span class=\"hotkey\">date: none</span> for items with no date. You can use quotes in date searches to for more complex dates like <span class=\"hotkey\">after:”June 20”</span>. There’s a new <span class=\"hotkey\">between</span> search for for showing dates in a range, like <span class=\"hotkey\">between:today,today+3</span>.</p>\n<h2 id=\"and-tons-of-small-improvements\">And tons of small improvements</h2>\n<ul>\n<li>Clicking links no longer requires holding a modifier key</li>\n<li>Added a message to the top of the Drive pane to select items from Drive</li>\n<li>Images work better, specifically editing around them and resizing them</li>\n<li>Added support for Base64 images. Just paste in a data:image and you’ll see a pretty picture.</li>\n<li>Added OPML support. It’s now an option in the import and export windows, and is also supported in paste.</li>\n<li>Added support for <span class=\"hotkey\">file:///</span> urls for linking to local files</li>\n<li>Added <span class=\"hotkey\">===</span> as a heavy divider line, in addition to <span class=\"hotkey\">—</span> which is a light divider line</li>\n<li>Moving items between documents now moves them directly (instead of deleting the old items and creating new items) which is faster and fixes it breaking internal links</li>\n<li>Added edit and remove link options to the context menu on links</li>\n<li>Sorting boards is generally better, more nicely animated, and is faster</li>\n<li>The document renaming popup starts with the current name</li>\n<li>Item animations are much smoother</li>\n<li>Resizing calendar events is much faster (it was previously modifying the item while resizing, and now it waits until it’s finished resizing)</li>\n<li>Inputting accented characters was sometimes not working</li>\n<li>All the places that show today’s date change automatically after midnight more consistently</li>\n<li>Linked items were showing up as false positives in searches</li>\n</ul>\n<h1 id=\"thanks-to-our-beta-testers\">Thanks to our beta testers</h1>\n<p>Our beta testers were a huge help throughout the process of this update, stress testing and helping find bugs, and helping direct the design changes to be more user friendly. If you’d like to try new features early and help shape Moo.do into a better tool for you, please <a href=\"https://www.moo.do/beta/\">join the beta group</a>.</p>\n<h1 id=\"next-up\">Next up</h1>\n<p>Google’s authentication system has been increasingly throwing errors and causing reauthentication messages, so that’s first up to fix. Then we plan to focus on fixing any remaining small issues, and then shift focus over to a redesign of the mobile apps. If you have anything you’d like us to prioritize please let us know at <a href=\"mailto:contact@moo.do\">contact@moo.do</a>.</p>\n"},{"title":"Mobile Dark Mode and Fixes","slug":"mobiledark","category":"updates","date":"Tue May 12 2020 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>The new iOS and Android updates today bring dark mode support as well as tons of bugfixes that we’ve been working on and beta testing for a couple of weeks:</p>\n<ul>\n<li><strong>Feature</strong>: Dark mode! Moo.do will now use the system dark mode setting, and Moo.do has a new setting to choose light or dark mode</li>\n<li><strong>Change</strong>: The keyboard toolbar is now two rows and the buttons show the state for the selected item</li>\n<li><strong>Change</strong>: Bottom tabs always show text instead of only when selected, and they’re now white with a light shadow</li>\n<li><strong>Fix</strong>: Editing text generally works much more smoothly</li>\n<li><strong>Fix</strong>: Search waits to update until the keyboard is closed so it won’t hide items while typing</li>\n<li><strong>Fix</strong>: Some items were measuring incorrectly and overflowing onto another line unnecessarily</li>\n<li><strong>Fix</strong>: On Android, tapping an item sometimes moved the keyboard toolbar into the wrong place</li>\n<li><strong>Fix</strong>: On iOS, the keyboard coming up was hiding the status bar</li>\n<li><strong>Fix</strong>: Scrolling the tapped item into place is faster and smoother</li>\n<li><strong>Fix</strong>: The overview drawer was sometimes flashing gray while the app opened</li>\n<li><strong>Fix</strong>: Setting a time before setting a date sometimes caused a crash</li>\n<li><strong>Fix</strong>: Added items were not using the default prefix</li>\n<li><strong>Fix</strong>: The app could get stuck on Updating… after clearing app data</li>\n<li><strong>Fix</strong>: Tapping a note in multiselect now selects its parent item</li>\n<li><strong>Fix</strong>: Increased vertical spacing in the Agenda so it doesn’t crop times</li>\n<li><strong>Speed</strong>: Improved load time when Gmail plugin is enabled</li>\n</ul>\n<p>If you have any requests or suggestions, please <a href=\"mailto:contact@moo.do\">let us know</a> or join our <a href=\"https://www.moo.do/beta\">beta community</a>.</p>\n"},{"title":"Gmail Add-On","slug":"gmailaddon","category":"updates","date":"Sun May 10 2020 08:00:00 GMT+0800 (Singapore Standard Time)","contents":"<p>Moo.do’s Gmail Add-On is now available! It runs inside of Gmail in any browser, and even in the Gmail iOS and Android apps. This Add-On lets you save any email into a Moo.do document right from Gmail. You can install it into your Gmail account here: <a href=\"https://gsuite.google.com/marketplace/app/moodo/597847337936\">https://gsuite.google.com/marketplace/app/moodo/597847337936</a></p>\n<p>This is in addition to the Chrome extension announced in a <a href=\"/blog/chromeextension\">previous update</a>, which adds a button to the top of Gmail in Chrome. You can install that at <a href=\"https://chrome.google.com/webstore/detail/moodo/dfphnckjoinkfflhfbnjoiggfflnekcb\">https://chrome.google.com/webstore/detail/moodo/dfphnckjoinkfflhfbnjoiggfflnekcb</a>.</p>\n<p>If you have any requests or suggestions, please <a href=\"mailto:contact@moo.do\">let us know</a> or join our <a href=\"https://www.moo.do/beta\">beta community</a>.</p>\n<h1 id=\"up-next\">Up next</h1>\n<p>We have some big updates to the mobile apps on the way, fixing a lot of bugs and adding Dark mode. We’ll have another post about that shortly, and we’re continuing to focus mainly on bugfixing and stability.</p>\n"}],"numPages":16,"path":"/blog/updates"}}
